[
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/aashu-yadav",
    "name": "Aashu Yadav",
    "location": "Kandivali East, Mumbai",
    "experience": "15 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919969757600",
    "email": "kkeshavraja@gmail.com",
    "website": "https://theindianlegaldirectory.com/www.aashu.in",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/aashu-yadav&title=Aashu%20Yadav&summary=Aashu%20Yadav&source=Aashu%20Yadav",
    "bio": "",
    "practice_areas": [
      "Arbitration Law"
    ],
    "forums_of_practice": [
      "Supreme Court of India"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/abhishek-magotra",
    "name": "Abhishek Magotra",
    "location": "O26A, Jangpura Extension, New Delhi 110017, India",
    "experience": "16 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "911144711249",
    "email": "abhishek@mslaw.in",
    "website": "https://mslaw.in/",
    "linkedin": "https://www.linkedin.com/in/abhishek-magotra-a57b926/",
    "bio": "He is a Registered Patent and Trademark Attorney with extensive experience in Intellectual Property prosecution since 2006. With an in-depth knowledge in the field of law and technology, Abhishek specializes in creating roadmaps for clients’ Research and Development activities.\nHis expertise includes advising clients to optimize their Research and Development activities, manage their Intellectual property portfolios including concept identification, decision Making, and protection of their Intellectual Property Rights. He advises clients on risk mitigating measures in carrying out research and development to ensure high predictability and least vulnerability in their business.\nAbhishek has extensive experience in providing end-to-end solutions to clients in the field of Intellectual Property Rights. Apart from performing due diligence of clients’ Intellectual Property assets, he plays an important role in drafting, filing and prosecution processes of patent applications in India as well as in foreign jurisdictions. This includes international patent application filings and prosecution such as Paris Convention patent applications, PCT applications and related national stage patent applications. He is instrumental in handling oppositions before Indian patent offices, appeals, invalidation proceedings and litigation before Indian Courts.\nAbhishek regularly conducts client and third-party portfolio review, complex freedom-to-operate studies, infringement and validity opinion and creates strategic plans for large and small scale companies.\nAbhishek’s other areas of expertise include filing, prosecution and opposition challenges in respect of Industrial Designs and Trademarks apart from providing technology transfer strategy, commercialization, technical know-how, evaluation and valuation of Intellectual Property Rights. Abhishek also helps clients grow their Patent, Trademark and Industrial Design assets while advising them in peripherals like assignment, contracts and license agreements.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "Bankruptcy & Insolvency",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/aditya-kashyap",
    "name": "Aditya Kashyap",
    "location": "AB-21, Tilak Marg",
    "experience": "3 years of experience.",
    "languages": [
      "Bengali\nEnglish\nHindi\nMaithili\nSanskrit"
    ],
    "phone": "917903148321",
    "email": "adityak.office@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/aditkashyap885/",
    "bio": "Dedicated legal professional with a passion for justice, social impact, and continuous learning. Currently practicing as an Advocate at the Supreme Court of India and the Delhi High Court. My expertise spans constitutional law, criminal law, and international human rights.\n\nA graduate from National Law University, Punjab, I also served as the National Co-convenor of Think India for two terms. Post my graduation, I joined as a Law Researcher to Justice C D Singh at Delhi High Court for about 2 years. Thereafter, I worked at a litigation firm Karanjawala & Co. at Delhi. I am currently attached as an Associate to Mr Vikramjit Banerjee, Sr Advocate & Additional Solicitor General of India at the Supreme Court.\n\nSince student days, I have been instrumental in filing cases, letter petitions and legal representations before constitutional and statutory authorities in public interest in a number of social and national causes. I frequently write on social, legal and political issues and contributes to the contemporary discourse. As an avid reader and researcher, my interest areas include Constitutional Law, Criminal Justice, IPR Law, Arthashashtra, Soft Power, and National Security.",
    "practice_areas": [
      "Arbitration Law",
      "Family Law",
      "Motor Accidents",
      "Company Registration",
      "Intellectual Property",
      "POSH Advisory",
      "White Collar Crimes",
      "Criminal Law",
      "Contracts",
      "Mediation & Conciliation",
      "Media & Entertainment",
      "Start-up Advisory & Compliance",
      "Environmental Law",
      "Human Rights Law",
      "Constitutional Law",
      "Cyber Law",
      "Dispute Resolution",
      "Artificial Intelligence",
      "Electricity & Energy",
      "Service Law",
      "Space Law"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "Saket Court",
      "National Consumer Disputes Redressal Commission"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/adv-ashish-shukla",
    "name": "Adv Ashish Shukla",
    "location": "410 Guruwar peth, Gavari aali, Pune- 411042.",
    "experience": "6 years of experience.",
    "languages": [
      "English\nHindi\nMarathi"
    ],
    "phone": "8149633395",
    "email": "adv.ashishrshukla@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/ashish-shukla-040383193?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
    "bio": "I am an Advocate practicing indivisually in District and Sessions court at Pune, a beacon of justice since 2019, extending my unparalleled legal expertise in Pune. Specializing in civil and criminal law, property disputes, family matters, and divorce proceedings, my deep understanding and experience guarantee clients the highest quality representation. My commitment to providing clients with the highest quality legal counsel is unwavering, ensuring they navigate the complexities of the legal landscape with confidence and emerge victorious.",
    "practice_areas": [
      "Family Law",
      "Motor Accidents",
      "Matrimonial Disputes",
      "Divorce",
      "Criminal Law",
      "Property Law",
      "Civil Litigation",
      "Cyber Law",
      "Succession & Estate Planning"
    ],
    "forums_of_practice": [
      "Debts Recovery Tribunal, Pune",
      "Shivajinagar District Court (Pune)",
      "Pune Sessions Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/advocate-krishna",
    "name": "Advocate Krishna",
    "location": "No.1/40, VJ Flats, Valmiki Street, Thiruvanmiyur, Chennai - 600 041 (Opp. Thiruvanmiyur Bus Terminus)",
    "experience": "15 years of experience.",
    "languages": [
      "English\nKannada\nTamil\nTelegu"
    ],
    "phone": "919442388179",
    "email": "advocatekrishnaa@gmail.com",
    "website": "http://www.advocatekrishna.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/advocate-krishna&title=Advocate%20Krishna&summary=Advocate%20Krishna&source=Advocate%20Krishna",
    "bio": "Advocate Krishna & Associates are full pledged Lawyers for Family related matters, Cinema/Serial related issues and Bail, Writ related matters. We are providing efficient result oriented solution to the clients.",
    "practice_areas": [
      "Family Law",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "Contracts",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Debt Recovery",
      "Banking & Finance"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/advocate-maninder-singh",
    "name": "Advocate Maninder Singh",
    "location": "145 & 169-A, SBS Block Near Gate VIII. District & Session Courts, Gurugram, Haryana, India 122001",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "9354560099",
    "email": "developer.treadon@gmail.com",
    "website": "https://advocatemanindersingh.com/",
    "linkedin": "https://www.linkedin.com/company/maninder-singh-advocates-consultants/",
    "bio": "We are a team of legal advocates who offer all-encompassing legal assistance across Delhi-NCR. Our advocates are specialists in their fields, offering you expertise honed through years of navigating courtrooms and legal intricacies. After working in different practice areas for several years and managing intricate matters for individuals and high-profile MNCs, we have joined hands at our firm. We have brought our expertise to the table, striving to safeguard people’s interests with utmost professionalism. Your case deserves nothing less than seasoned professionals dedicated to your cause.",
    "practice_areas": [
      "Business Law"
    ],
    "forums_of_practice": [
      "District & Sessions Court, Gurugram"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/advocate-rohit-dandriyal",
    "name": "Advocate Rohit Dandriyal",
    "location": "434, LGF, NH-19, Jangpura, New Delhi, Delhi 110014, India",
    "experience": "9 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "9897777427",
    "email": "rohitdandriyal@gmail.com",
    "website": "https://advocaterohitdandriyal.com/home/criminal-lawyer-in-delhi-india/",
    "linkedin": "https://in.linkedin.com/in/rohit-dandriyal-4b766842",
    "bio": "Rohit Dandriyal is a leading advocate in Delhi, India. Established in 2015, the Chamber of Rohit Dandriyal is renowned for its excellence in criminal law practice. Mr. Dandriyal, a distinguished criminal lawyer in Delhi, actively practices at the Supreme Court of India, the High Court of Delhi, and all district courts in Delhi. He is particularly noted for his expertise in criminal trial proceedings, bail matters, and especially NDPS bail and trials.\nHis office is centrally located in Jungpura, Delhi, just 5 km from both the Supreme Court of India and the Delhi High Court. Mr. Dandriyal has been practicing criminal law primarily at the Delhi High Court and the Supreme Court of India since 2015.\nThe law office has an extensive practice primarily in Delhi, comprising eminent lawyers who meticulously identify and address clients’ needs. The firm believes that no case is indefensible and provides comprehensive legal services under criminal law, from the registration of criminal complaints as FIRs to various stages such as investigation, bail, charge, trial, appeal, and revision.\nOur team is organized into four specialized tiers:\n•⁠ ⁠Trial Court Team\n•⁠ ⁠High Court Team\n•⁠ ⁠Supreme Court Team\n•⁠ ⁠Legal Research Team\nWe offer legal protection to clients from undue police harassment by obtaining stay orders, bail, anticipatory bail, and restraining orders from High Courts. Our firm assists clients at every level of trial as defense counsel, with each lawyer specializing in their respective fields and excelling in solution-oriented approaches. Our litigation practice spans every forum and area of law, tailored to meet the specific needs and requirements of our clients. Our core aim is to serve our clients and secure relief and justice for them within the bounds of the law. Criminal law practice remains our primary area of focus, with significant practice before the Supreme Court of India and High Courts across the country, particularly in Delhi, Uttarakhand, Rajasthan, Allahabad, Lucknow, Mumbai, and Chandigarh.",
    "practice_areas": [
      "Family Law",
      "Divorce",
      "Criminal Law"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/advocate-tarun-biswas",
    "name": "Advocate Tarun Biswas",
    "location": "Plot no 6, Sector 22 Dwarka, Dwarka, Delhi, 110077",
    "experience": "10 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "9289105382",
    "email": "advtbiswas03@gmail.com",
    "website": "https://advocatetarunbiswas.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/advocate-tarun-biswas&title=Advocate%20Tarun%20Biswas&summary=Advocate%20Tarun%20Biswas&source=Advocate%20Tarun%20Biswas",
    "bio": "Tarun Biswas, enrolled as an advocate with the Bar Council of Delhi since 2015, has been in continuous practice since then with a strong dedication to delivering overarching legal services.\nOver the years, Tarun’s practice has evolved to focus on two key areas of expertise: the Real Estate (Regulation and Development) Act (RERA) and Contract Law. This specialization reflects his commitment to providing clients with tailored, expert guidance in navigating the complexities of real estate transactions and contractual matters, ensuring they receive precise legal solutions aligned with their needs.",
    "practice_areas": [
      "Intellectual Property",
      "Contracts",
      "Real Estate"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/afnaan-siddiqui",
    "name": "Afnaan Siddiqui",
    "location": "912 Wave Silver Tower, Sector -18, Noida, 201301",
    "experience": "7 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919711261555",
    "email": "afnaan@corplegex.com",
    "website": "https://www.corplegex.com/",
    "linkedin": "https://www.linkedin.com/in/afnaan-siddiqui-9b2b3865?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_contact_details%3BrVE73jgkSuC2zJSxYPB7cw%3D%3D",
    "bio": "With experience in the area(s) of Corporate Advisory and Dispute Resolution, Mr. Siddiqui advises clients on Corporate Restructuring (M&A and Transaction), Insolvency and Bankruptcy Code, 2016, Oppression & Mismanagement, and General Corporate matters.\n\nHe is the firm's founding member and possesses around eight years of experience in the consulting practice.\n\nWith his exceptional skills in complex transactions of Corporate Restructuring, he has managed more than 80 (Eighty) Corporate Restructuring and Insolvency transactions.\n\nHe is regularly appearing before the High Court of Delhi, various benches of the National Company Law Tribunal, and the National Company Law Appellate Tribunal.",
    "practice_areas": [
      "Contracts",
      "Start-up Advisory & Compliance",
      "Mergers & Acquisitions",
      "General Corporate",
      "Capital Markets",
      "Competition & Anti-trust",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "Bombay High Court",
      "Calcutta High Court",
      "National Company Law Tribunal (NCLT)",
      "National Company Law Appellate Tribunal (NCLAT)"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/aishwarya-parashar",
    "name": "Aishwarya Parashar",
    "location": "Delhi",
    "experience": "3 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919654605766",
    "email": "aishwaryaparashar24@gmail.com",
    "website": "https://attorneyschecklist.com/",
    "linkedin": "http://linkedin.com/in/aishwarya-parashar-17b331163",
    "bio": "I have over 2.5 years of experience in dealing with civil and commercial litigation and corporate transactions, including but not limited to, M&A -advisory and transaction structuring, due diligence and drafting of all supporting agreements. My expertise lies in drafting commercial contracts and I have extensively dealt with arbitration matters before various high courts in India.\nIn addition to my legal practice, I am passionate educator and strives to inspire the next generation of legal professionals, aiming to equip them with the skills necessary to thrive in a competitive industry.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "Contracts",
      "Mediation & Conciliation",
      "Fashion Law",
      "General Corporate",
      "Civil Litigation",
      "Dispute Resolution"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ajay-basutkar",
    "name": "Ajay Basutkar",
    "location": "102, 1st floor, Vikas, Nyamurti G N Vaidya Road, next to Jimmy Boy, Fort, Mumbai 400001",
    "experience": "15 years of experience.",
    "languages": [
      "English\nHindi\nMarathi"
    ],
    "phone": "919819241616",
    "email": "info@abchambersoflaw.com",
    "website": "https://abchambersoflaw.com/",
    "linkedin": "https://www.linkedin.com/in/ajay-basutkar-b5aa5228/",
    "bio": "Ajay Basutkar is a skilled lawyer and advocate enrolled with the Bar Council of Maharashtra & Goa. With a Bachelor’s degree in Computer Science and a Bachelor of Law (LL.B) degree, as well as a Post Graduate Diploma in Cyber Laws from Mumbai University, Ajay has a wealth of legal knowledge and expertise.\nSpecializing in litigation of all types, Ajay has a deep understanding of court procedures and functioning, which gives him an edge in drafting effective pleadings for various courts across India. Additionally, Ajay has extensive knowledge and experience in areas such as Corporate Laws, Arbitration, Intellectual Property, Information Technology, Banking, Real Estate, and Testamentary matters. He is well-versed in relevant case law and can provide expert guidance on a range of legal issues.\nAjay has a regular presence in various courts and has a proven track record of successfully arguing and winning cases in all types of Civil and Criminal matters. His attention to detail, thoroughness, and dedication to his clients set him apart in the legal profession.\nIf you’re looking for a lawyer who can provide you with sound legal advice and effective representation, Ajay Basutkar is the advocate to turn to.",
    "practice_areas": [
      "POSH Advisory",
      "Criminal Law",
      "Contracts",
      "Media & Entertainment",
      "Mergers & Acquisitions",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Infrastructure & Projects"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/aji-v-dev",
    "name": "AJI V DEV",
    "location": "Aji V Dev & Associates, Room No.16, 4th Floor, Empire Building, Oppo: Central Police Station, Near High Court, Kombara, Ernakulam -682 018",
    "experience": "30 years of experience.",
    "languages": [
      "English\nMalyalam"
    ],
    "phone": "9447788404",
    "email": "ajivdev@yahoo.co.in",
    "website": "https://taxnbizlaws.wordpress.com/",
    "linkedin": "https://www.linkedin.com/in/aji-vdev-63bba824/",
    "bio": "I am Aji V. Dev, a practising lawyer in the High Court of Kerala, Ernakulam. I hail from Vallicodu- Kottayam a beautiful village near to Pathanamthitta in the Kerala state of India, where undulating hills decorated by tall trees and lush green vegetation descends to the paddy fields in a rhythmic way. The long journey started in 1964.\nHaving a middleclass background, growing up in such a habitat with my parents, two sisters, lot of cousins, friends and fairy tales was a wonderful experience, indeed. The memorabilia include my schooling there in the S.N.D.P. U.P School and N.S.S. High School. Studies continued on at Catholicate College, Pathanamthitta, N.S.S. College, Pandalam, Government Arts College, Thiruvananthapuram and School of Indian Legal Thought, the law department of the Mahatma Gandhi University, Kottayam. I earned my masters degree in Economics from the University of Kerala, Thiruvananthapuram and then earned another masters degree in Law from the Mahatma Gandhi University, Kottayam.\nEventually I shifted to Kottayam, a bustling town in south central Kerala, famous for its 3 L’s, Lakes, Latex and Letters, where I joined as an employee in the Mahatma Gandhi University, Kottayam in 1990. After having a short stay there, I relieved therefrom in 1992 to join as an Assistant Sales Tax Officer, with the Kerala State Sales Tax Department, now known as the State GST Department.  In 2012, when I was an Assistant Commissioner with the Department, in Ernakulam I took voluntary retirement leaving the balance service up to May, 2020 and started my practice as a lawyer and founded Aji V Dev &amp; Associates, the lawyer firm in Ernakulam. I currently live in Ernakulam, Kochi, the “Queen of the Arabian Sea”. My passion for law, business, reading, writing, travelling and for motivational thinking is inherent. I am a regular or a frequent columnist in various magazines.",
    "practice_areas": [
      "Arbitration Law",
      "Taxation",
      "Contracts",
      "Debt Recovery",
      "Capital Markets",
      "Banking & Finance",
      "Business Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/akash-yadav",
    "name": "Akash Yadav",
    "location": "C-562, LGF, Defence Colony, New Delhi - 110024",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "918826436952",
    "email": "akash@revolutelaw.com",
    "website": "https://www.revolutelaw.com/",
    "linkedin": "https://www.linkedin.com/in/akashyadav940/",
    "bio": "Akash Yadav, Co-Founder of Revolute Law, has a robust academic background from prestigious institutions. He has completed his LL.B. from the Faculty of Law, University of Delhi, coupled with a diploma in Intellectual Property Rights from ISIL. Prior to that, he obtained his degree in Economics from Hansraj College, University of Delhi.\nSpecializing in constitutional, civil, and taxation laws, Akash appears regularly before the Hon’ble Supreme Court of India, High Court of Delhi, District Courts, and Tribunals across Delhi. His diverse legal experience positions him as a versatile strategist in the legal sector.\nAkash has represented clients across a spectrum of legal matters, from litigating against policy decisions to challenging banking regulatory notifications amongst others. He has also represented various multinational companies, enterprises, start-ups, and individuals alike in an array of civil, constitutional, and commercial matters. His previous work experiences underline his commitment to delivering results and ensuring client satisfaction.\nBelieving in “Adversity breeds innovation and invention,” Akash always strives for a solution-oriented approach. Whether navigating complex legal landscapes or crafting strategies for quick resolutions, he ensures a seamless and efficient process with a quick turnaround time.\nBeyond the courtroom, Akash is an avid traveler, sports enthusiast, and an occasional photographer. His commitment to sustainable travel and community initiatives, coupled with interests in Formula 1 and cricket, adds a vibrant dimension to his personality.\nAkash consistently achieves exceptional results, securing favorable outcomes for the businesses he collaborates with. His practical approach, coupled with meticulous attention to detail, establishes him as a trusted advisor for clients in search of reliable legal counsel.",
    "practice_areas": [
      "Bankruptcy & Insolvency",
      "Start-up Advisory & Compliance",
      "Real Estate",
      "Constitutional Law",
      "Civil Litigation",
      "Data Privacy & Protection"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/akshat-hansaria",
    "name": "Akshat Hansaria",
    "location": "5, Babar Lane, Connaught Place, New Delhi-110001",
    "experience": "16 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919810253550",
    "email": "anhansaria@svarniti.com",
    "website": "https://www.svarniti.com/",
    "linkedin": "https://www.linkedin.com/in/akshat-hansaria-77239714/",
    "bio": "Akshat Hansaria co-heads the Commercial Litigation and Arbitration practice at Svarniti Law Offices. Akshat has more than 15 years of experience in the field of Commercial Litigation and Arbitration disputes. He completed his law (B.A. LLB (Hons.)) from Amity Law School, New Delhi, and his Master of Laws (LLM) in International Business Laws from London School of Economic and Political Science, London.\nAkshat focus’ on multiple practice areas in commercial litigation and arbitration, both domestic as well as international commercial arbitration, insolvency, regulatory, employment.\nHe has represented clients in automotive, banking, civil aviation, defence, household goods and services, infrastructure, pharmaceutical, oil and gas, power, telecom sectors etc. He has also represented clients in high stake arbitrations involving not only large Indian conglomerates but also International companies from various countries, including, Canada, France, Japan, Italy, Netherlands, South Africa, Singapore, South Korean and others.\nHe has represented clients in various fora across the country, including, the Supreme Court of India, the High Courts at Delhi, Bombay, Madras, Kolkata, Hyderabad, Allahabad, Ahmedabad, Bangalore, Kochi, Guwahati; various Tribunals, including the National Company Law Appellate Tribunal, National Company Law Tribunals at Delhi and Hyderabad etc.\nHis clientele does not only include Indian companies but also include large foreign conglomerates such as American Pharmaceutical Company, Canadian Telecom Company, French Energy Management Company, German Automotive Company, Japanese Pharmaceutical Company, Italian Oil and Gas Company, South African Pharmaceutical Company, South Korean Household Products Company etc.\nAkshat also has extensive regulatory experience before various Tribunals, including Central Administrative Tribunal, National Green Tribunal, Telecom Disputes Settlement and Appellate Tribunal, Appellate Tribunal for Electricity and others.",
    "practice_areas": [
      "Employment & Labour Laws",
      "White Collar Crimes",
      "Bankruptcy & Insolvency",
      "Environmental, Social & Governance",
      "Data Privacy & Protection",
      "Artificial Intelligence",
      "Banking & Finance"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/alankar-narula",
    "name": "Alankar Narula",
    "location": "5826, Sector 38 West, Chandigarh - 160036",
    "experience": "10 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919814422039",
    "email": "contact@narulaandnarula.com",
    "website": "https://narulaandnarula.com/",
    "linkedin": "https://www.linkedin.com/company/narula-&-narula-law-offices/",
    "bio": "Alankar Narula is an accomplished advocate and the Managing Partner at Narula & Narula Law Offices, known for his extensive experience in civil and criminal litigation, arbitration, and constitutional law. With a practice spanning diverse areas, Alankar has successfully represented clients in landmark cases across the Hon’ble Supreme Court, High Courts, and specialized tribunals.\nHis portfolio includes notable reported judgments such as S. Rajgopal V. State of Haryana and Others, M/s Aar Dee Enterprises V. State of Punjab and Others, and NHPC Limited V. Chairman-Cum-Managing Director, Patel – L&T, among others, which have set significant legal precedents. His expertise extends to writ petitions involving fundamental rights, high-stakes arbitration, and criminal defenses in cases of bail and personal liberty.\nA former Assistant Advocate General for the State of Punjab, Alankar has adeptly handled matters before the Hon’ble Punjab and Haryana High Court, Chandigarh. His commitment to delivering innovative legal solutions is matched by his entrepreneurial acumen, having previously founded a legal services startup catering to over 500 clients globally.\nAlankar’s passion for the law is complemented by his thought leadership, where he actively engages with the legal community through discussions on contemporary issues. Under his stewardship, Narula & Narula Law Offices has grown into a dynamic and client-centric practice, celebrated for its integrity and excellence.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "Contracts",
      "Start-up Advisory & Compliance",
      "NRI Legal Assistance",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "Punjab & Haryana High Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/amit-kumar-mishra",
    "name": "Amit Kumar Mishra",
    "location": "5, Babar Lane, Connaught Place, New Delhi-110001",
    "experience": "18 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919899319674",
    "email": "amishra@svarniti.com",
    "website": "https://www.svarniti.com/",
    "linkedin": "https://www.linkedin.com/in/amit-mishra-77565113/",
    "bio": "Amit Mishra Founder, Commercial Litigation and Dispute Resolution National University of Juridical Sciences (NUJS), B.A. LL.B. (Hons.)\nAmit Mishra heads the Commercial Litigation Dispute Resolution Practice at Svarniti Law Offices. Previously, Amit headed the Dispute Resolution practice of P&A Law Offices for 10 years. His practice focuses on Policy advisory, International arbitration, commercial litigation and Investment treaty arbitration, primarily representing the Government of India. Amit has represented several Indian, U.S., European and Asia-Pacific corporations before the Supreme Court of India, the High Court of Delhi, Company Law Board and other tribunals including the Securities Appellate Tribunal, Board for Industrial and Financial Construction, Commission of Income Tax and Director General of Anti-Dumping.\nAmit regularly advises the Government of India and other Public Sector Undertakings on their dispute strategy. He is a visiting faculty (seminar courses) at the National Law University Delhi and Jindal Global Law School.\nAmit has been recognised by GAAR for his work in the Bilateral Investment Treaty Arbitration representing the Government of India Further, he has been a recipient of Awards from Legal Era, Legal 500, Chambers etc.\nBesides working closely with the Government of India on several arbitrations, Amit has been actively involved with them in policy shaping and making effective representations before relevant ministries and their departments in the gaming and technology sector. Amit has also been involved in policy discussions and issues discussed by associations such as FICCI.",
    "practice_areas": [
      "Employment & Labour Laws",
      "White Collar Crimes",
      "Bankruptcy & Insolvency",
      "Environmental, Social & Governance",
      "Data Privacy & Protection",
      "Artificial Intelligence",
      "Banking & Finance"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ananya-choudhury",
    "name": "Ananya Choudhury",
    "location": "105,119 PATIALA HOUSE COURTS, INDIA GATE, NEW DELHI 110001",
    "experience": "7 years of experience.",
    "languages": [
      "Bengali\nEnglish\nHindi"
    ],
    "phone": "01205162845",
    "email": "ananyachoudhury.adv@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/adv-ananya-choudhury-440b7764",
    "bio": "1. Experienced Lawyer for Civil, Criminal and Family Cases.\n2. Legal support and Solicitation for Individuals and Small companies for Legal notices, Cheque bounces and Recovery of Debt.\n3. Divorce and Settlement including Maintenance and Child Custody.\n4, Partition of Property and Family Dispute Resolution.\n5. Criminal Cases of Fraud, Forgery and Embezzlement.\n6. Labour and Employment Laws\n7. Environmental Laws\n8. Negligence, Nuisance and Civil Wrongs\n9. Inheritance Laws and Registration of Wills\n10. Mediation, Conciliation and Resolution with Agreements.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Family Law",
      "Motor Accidents",
      "Employment & Labour Laws",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "Criminal Law",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Mediation & Conciliation",
      "Media & Entertainment",
      "Environmental Law",
      "Real Estate",
      "Property Law",
      "Human Rights Law",
      "Civil Litigation",
      "Debt Recovery",
      "Private Client Practice",
      "Cyber Law",
      "Data Privacy & Protection",
      "Dispute Resolution",
      "Banking & Finance",
      "Succession & Estate Planning",
      "Negotiation",
      "Legal Advisory & Consultancy",
      "Risk Assessment & Management"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "Tis Hazari Court",
      "Karkardooma Court",
      "Patiala House Court",
      "Dwarka Court",
      "Rouse Avenue Court",
      "National Company Law Tribunal (NCLT)",
      "Saket Court",
      "National Company Law Appellate Tribunal (NCLAT)",
      "District & Sessions Court, Gurugram"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/anirudh-krishnan",
    "name": "Anirudh Krishnan",
    "location": "Chennai",
    "experience": "20 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "917299088824",
    "email": "anirudh@aklawchambers.com",
    "website": "https://aklawchambers.wordpress.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/anirudh-krishnan&title=Anirudh%20Krishnan&summary=Anirudh%20Krishnan&source=Anirudh%20Krishnan",
    "bio": "“Anirudh Krishnan of AK Law Chambers is widely viewed as a prominent figure in the market, with commentators describing him as “technically able, with a sharp mind.” He is admired for his adept handling of both litigation and arbitration work.”– Chambers and Partners, Asia Pacific, 2019\n“Thomas Williams, a London-based barrister and partner at Womble Bond Dickinson, describes Anirudh Krishnan, founding partner of AK Law Chambers in Chennai, as an “exceptional lawyer of the highest intellect and integrity”. Sentiments echoed by Baiju Vasani, a London-based partner at Jones Day, who applauds Krishnan, for being “highly experienced, sharp, creative problem solver”- India Business Law Journal’s- The ‘A’ List, India’s top 100 lawyers of 2018\n“Anirudh Krishnan of AK Law Chambers is highly regarded as an “arbitration specialist” and admired by interviewees because “he spends time on the matters, conducts his own research and studies the issues in depth before presenting the legal strategy.” His ability to “deconstruct complex issues within a short time” and increasingly impressive “courtroom presentation and thinking on his feet” also attract high praise.” – Chambers and Partners, Asia-Pacific, 2018\n“According to sources, Anirudh Krishnan of AK Law Chambers “has already earned an immense reputation at such a young age, and has a very bright future ahead of him.” He has a broad practice, earning particular praise for his “vast knowledge of international commercial arbitration,” as well as his “business savvy and strategy.” Lately he advised Shapoorji Pallonji & Co in a litigation and SIAC arbitration over a USD15.5 million contract for the construction and development of residential and commercial towers in Bengaluru.“- Chambers and Partners, Asia Pacific, 2016\nAnirudh Krishnan of AK Law Chambers attracts a raft of praise for his arbitration and litigation expertise. Peers describe him as “a rising star with great potential.” He lately acted for Adam & Coal Resources in Supreme Court litigation against a Swiss trading company, concerning the repayment of monies owed. Interviewees praise his solutions-oriented approach, stating: “He’s so creative, he always gives the client several options.” “– Chambers and Partners, Global\n“AK Law Chambers’ founder partner, Anirudh Krishnan, was a consultant to an expert panel constituted by the Law Commission of India to deliberate on the proposed reforms to arbitration law in India. The commission’s report states that input given by him and another expert was “incisive, vital and require special appreciation.”– Indian Business Law Journal\nAnirudh Krishnan is the founder partner of AK Law Chambers. Being a law graduate from NALSAR, Hyderabad, and completed the BCL course from Oxford University, Anirudh is also a qualified Solicitor of England and Wales. He handles commercial and public law litigation, arbitration and corporate advisory work of the firm.\nHis expertise in the field of domestic and international arbitration emerges from the authoritative two-volume book titled “Justice R.S. Bachawat’s Law of Arbitration and Conciliation” published by LexisNexis Butterworths Wadhwa Nagpur, of which he is the Chief-Editor and has contributed chapters in the international publications- “Handbook on Third-Party Funding in International Arbitration” and “CPR India Supplement”.\nDuring his stint at Clifford Chance, London, he has worked in among other areas on international arbitration and commercial litigation. He has been part of teams that have been involved in numerous arbitrations including ICC, LCIA, SIAC, AMTAC and ICSID arbitrations in addition to a number of domestic arbitrations. He has also acted on behalf of numerous corporates and Public Sector Undertakings before Indian courts. Anirudh has been empanelled as arbitrator with Nani Palkhiwala Arbitration Centre and has been appointed by the Chief Justice of the Madras High Court as an arbitrator.",
    "practice_areas": [
      "Arbitration Law",
      "Civil Litigation",
      "Dispute Resolution"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/anirudh-suresh",
    "name": "Anirudh Suresh",
    "location": "273, Rama Iyengar Road, V.V. Puram, Basavangudi, Bangalore 560004",
    "experience": "15 years of experience.",
    "languages": [
      "English\nHindi\nKannada"
    ],
    "phone": "919164333639",
    "email": "info@anirudhassociates.com",
    "website": "https://anirudhassociates.com/",
    "linkedin": "https://www.linkedin.com/in/advocateanirudhsuresh/",
    "bio": "Anirudh Suresh is a 1st Generation Corporate Lawyer with expertise in corporate and commercial litigation. His success story was recently featured on Brut. as he was recognised among Top 50 Disputes Lawyers in Asia (Litigation and Arbitration) by Thomson Reuters on the basis of his work, market feedback and client recommendations.\nAnirudh earlier headed the Delhi office of Bathiya Legal wherein he headed the North Indian Litigation practice in the firm and regularly appeared before various High Courts in India, Supreme Court of India, National Company Law Tribunal (NCLT) across India and the NCLAT. He also oversaw Private Equirty transactions when the buy side or sell side was based in Delhi.\nAnirudh has rich experience in Insolvency and Bankruptcy Code (from admission of CIRP to assisting the Resolution Applicant to take over the bankrupt company) and getting approvals from authorities in complex court approved merger schemes, white collar crimes and arbitration. Anirudh is a crusader for minority shareholder rights and assists minority shareholders in enforcement of their rights against majority shareholders.\nAnirudh has completed the NLSIU’s flagship distance education degree – Master of Business Laws and LL.M. in Corporate and Financial Laws from O.P.Jindal Global University enabling him to assess legal risks for better business decision making and has built a strong relation with the almuni from these renowned institutions thereby enabling him to represent his clients before various forums in different cities across the country.\nProfessional Associations include:\n• The Advocates’ Association, Bangalore\n• National Company Law Tribunal & Appellate Tribunal Bar Association\n• Delhi High Court Bar Association\n• NCLT Bar Association of Chandigarh\n• Mumbai Centre for International Arbitration",
    "practice_areas": [
      "Employment & Labour Laws",
      "Intellectual Property",
      "Contracts",
      "Start-up Advisory & Compliance",
      "Mergers & Acquisitions",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Debt Recovery",
      "Regulatory & Securities",
      "Private Equity & Venture Capital",
      "Restructuring",
      "Business Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/anshuman-singh",
    "name": "Anshuman Singh",
    "location": "N202, Udaigiri Apartment, Opposite Patna Museum old, Budh marg. Patna- 800001. Bihar",
    "experience": "7 years of experience.",
    "languages": [
      "English\nHindi\nPunjabi"
    ],
    "phone": "919771498770",
    "email": "anshuman.sngh@gmail.com",
    "website": "https://www.advanshumansingh.com/",
    "linkedin": "https://www.linkedin.com/in/adv-anshuman-singh-5583781b4?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
    "bio": "Anshuman Singh brings a wealth of experience in Matrimonial Law, Criminal Law, and Arbitration, serving clients in Patna and the surrounding areas. His practice covers all phases of legal disputes, from initial filings to final resolutions, with a focus on both criminal defense and matrimonial matters. Known for his strategic approach and thorough representation, Anshuman ensures clients receive clear, effective solutions tailored to their needs.\nServices Offered:",
    "practice_areas": [
      "Arbitration Law",
      "Family Law",
      "Matrimonial Disputes",
      "Criminal Law",
      "Mediation & Conciliation",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/arjun-bose",
    "name": "Arjun Bose",
    "location": "J-29, First Floor, Jangpura Extension, New Delhi 110014",
    "experience": "8 years of experience.",
    "languages": [
      "Bengali\nEnglish\nHindi"
    ],
    "phone": "919582485524",
    "email": "arjun.bose@curiamlegal.com",
    "website": "https://www.curiamlegal.com/",
    "linkedin": "https://www.linkedin.com/in/arjun-bose-991b8ab8/",
    "bio": "Acts for and advises Indian Insurers and Reinsurers as coverage counsel focusing on liability lines of business including D&O, E&O, Cyber, EPLI, Product Liability and FI. Arjun has also advised on claims under commercial lines such as industrial all risk, fire, engineering, marine cargo, contingency insurance and subrogation. He assists his clients with their coverage response following notification, associated claims handling and costs monitoring. Arjun also acts as defence counsel where coverage is contested and in subrogated recoveries pursued by his clients.",
    "practice_areas": [
      "Insurance Law",
      "Civil Litigation",
      "Telecom Law",
      "Data Privacy & Protection",
      "Dispute Resolution"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/arkadyuti-sarkar",
    "name": "ARKADYUTI SARKAR",
    "location": "39/A Narasingha Avenue, Kolkata - 700074",
    "experience": "4 years of experience.",
    "languages": [
      "Bengali\nEnglish\nHindi"
    ],
    "phone": "9163073189",
    "email": "advoarkad@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/arkadyuti-sarkar",
    "bio": "I am a practising Advocate with 3+ years of experience in providing legal advisory and consultancy, legal documentation, and drafting of commercial contracts.\nI have done my B.A. LL.B in 2020 from University of Calcutta and Legum Magister in 2022 from O.P. Jindal Global University.\nI provide services including but not limited to:\na) Trademark Filing and prosecution.\nb) Trademark renewal.\nc) Copyright registration.\nd) drafting agreements like sale deed, lease deed, employment agreement, consultancy agreement, rent agreement, etc.\ne) sending legal notices and responding to legal notices.",
    "practice_areas": [
      "Motor Accidents",
      "Intellectual Property",
      "Contracts",
      "Civil Litigation",
      "Conveyance"
    ],
    "forums_of_practice": [
      "Bankshall Court",
      "Alipore Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/arushi",
    "name": "Arushi",
    "location": "C-147, Pundrik Vihar Society, Pitampura, Delhi- 110034",
    "experience": "8 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "7827839971",
    "email": "arushi@satyakilegal.com",
    "website": "https://satyakilegal.com/",
    "linkedin": "https://www.linkedin.com/in/arushi-gupta-5b5b72124/",
    "bio": "Arushi is an experienced IP Attorney having hands- on experience in assisting and advising national and international clients in various aspects of Intellectual Property, including prosecution of applications for Trademark, Design and Copyright registration. She has, in her experience, rendered opinions and undertaken IP registrations like Trade Marks, Patents and Copyrights of notable companies like Blinkit (formerly known as Grofers), McCain, Boult Audio, Clovia, Sadar24, Zabella, The Big Chill Café, SNEAKARE, Namhya Foods and the like. She has also assisted several start-ups in understanding and strategizing their IP Assets so as to make them more profitable and acquire more goodwill. From obtaining registrations to preventing deceptive registrations and managing the portfolio of the clients, the services rendered to the start-ups have been all- embracing. As an awareness initiative taken up by Arushi, she holds and conducts webinars as well as seminars for IP Awareness with various institutions like Amity University, IIM Kashipur, Symbiosis Law School, Hyderabad, CIPAM, Veltech University, CISCO Launchpad, Teerthanker Mahaveer University etc. Till date, Arushi has worked on more than 500 Trademarks, 50 Patents and Designs and has rendered opinion with regards to copyright and has filed approximately 20 registration applications.",
    "practice_areas": [
      "Intellectual Property",
      "Contracts",
      "Start-up Advisory & Compliance"
    ],
    "forums_of_practice": [
      "Supreme Court of India"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/aryan-arora",
    "name": "Aryan Arora",
    "location": "S-456, Inder Mohan Bhardwaj Marg, Block S, Greater Kailash II, Greater Kailash, New Delhi, Delhi 110048",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919853753115",
    "email": "aryan@legalally.in",
    "website": "https://legalally.in/",
    "linkedin": "https://www.linkedin.com/in/aryan-arora-0373ab174/",
    "bio": "Aryan Arora is a leading corporate lawyer and Associate Partner in Sapphire and Sage Law Offices.",
    "practice_areas": [
      "Intellectual Property",
      "POSH Advisory",
      "Criminal Law",
      "Contracts",
      "Start-up Advisory & Compliance",
      "Debt Recovery",
      "Data Privacy & Protection"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ashraf-ali-shaikh",
    "name": "Ashraf Ali Shaikh",
    "location": "86A, Besides Topkhana Masjid. Old Topkhana, Shivajinagar, Pune - 411005.",
    "experience": "4 years of experience.",
    "languages": [
      "English\nHindi\nMarathi"
    ],
    "phone": "8983841015",
    "email": "shaikhali004@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/ashraf-ali-shaikh-69895316b?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
    "bio": "Highly dedicated and determined Advocate who has mastery in conducting cases and advancing arguments before various forums, in vast fields of Law but having specialization in Criminal Law.\nKey Qualities -",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Family Law",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "White Collar Crimes",
      "Criminal Law",
      "Mediation & Conciliation",
      "General Corporate",
      "Civil Litigation",
      "Cyber Law",
      "Conveyance",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "Bombay High Court",
      "Kukatpally District Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/astha-garg",
    "name": "Astha Garg",
    "location": "C-562, LGF, Defence Colony, New Delhi - 110024",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919999510912",
    "email": "astha@revolutelaw.com",
    "website": "https://www.revolutelaw.com/",
    "linkedin": "https://www.linkedin.com/in/astha-garg-b76863114?",
    "bio": "Astha Garg, Co-Founder of Revolute Law, boasts an illustrious career thus far representing clients across sectors and foras. Her clients range across sectors including oil & gas, renewable energy, infrastructure, banking & finance, and real estate. Astha is an alumna of Vasant Valley School, Delhi, and the Symbiosis International University, Pune, and is an active member of the Symbiosis Alumni Women Network.\nFrom representing waqf tenants before the Delhi High Court to representing the Government of India in one of the largest ongoing international commercial arbitrations in the oil and gas sector, Astha’s career represents her massive knowledge base in the sphere of commercial litigation and arbitration. Astha is a disputes resolution enthusiast whose practice is aimed at a cost-effective and result-oriented approach for her clients with the help of mediation and conciliation as and when a situation demands.\nPresently, Astha is also pursuing a certification course in International Arbitration from the University of Leiden. A firm believer in the power of negotiation, Astha is not just an astute litigator but an effective negotiator. She believes that most commercial disputes have the ability to be resolved if an entrepreneurial approach is adopted by both Parties and their Counsel.\nOutside the office, Astha is an avid reader, keen artist, and amateur photographer. She loves traveling to unexplored locations and experiencing life as the locals do. She believes that new experiences make one a well-rounded individual better suited to represent individuals from different walks of life.\nHer keen business acumen and dedication to client success make her an invaluable asset to organizations seeking legal guidance.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "Mediation & Conciliation",
      "General Corporate",
      "Banking & Finance",
      "Negotiation",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ayush-kalpasi",
    "name": "Ayush Kalpasi",
    "location": "#54, Dharchula Road, Siltham, Pithoragarh, Uttarakhand, 262501",
    "experience": "3 years of experience.",
    "languages": [
      "English\nHindi\nPunjabi"
    ],
    "phone": "8699752699",
    "email": "kalpasiayush@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/kalpasi-ayush",
    "bio": "Ayush Kalpasi is a seasoned media lawyer and intellectual property (IP) expert with a rich background in music law and entertainment rights. With years of hands-on experience representing artists, creators, and businesses, he is a trusted advocate for those navigating the intricate legal landscape of the media and entertainment industry.\nHaving worked with A-list artists and leading labels like Sony Music and Universal Music, Mr. Kalpasi brings a deep understanding of the nuances involved in safeguarding creative works and negotiating contracts. His expertise spans across media and entertainment law, music licensing, trademark protection, and IP portfolio management.\nHis dedication to the creative community extends beyond legal counsel; he has been running a free consultancy service to educate artists about their IP rights, helping them retain control over their creations. As a professional who blends legal acumen with a passion for empowering creators, Mr. Kalpasi has also worked closely with startups, businesses, and music publishing agencies, offering practical solutions tailored to their unique challenges.\nIn addition to his work in India, Mr. Kalpasi collaborates with international organizations, managing complex legal agreements and navigating global music licensing frameworks. Expanding his practice further, he is also actively working in the field of US Personal Injury Law, adding another dimension to his expertise. This international scope complements his IP work, which inherently operates on a global scale.\nWhether it’s drafting robust contracts, protecting intellectual property, or guiding clients through licensing negotiations, Mr. Kalpasi is a pioneer media lawyer committed to excellence and innovation.",
    "practice_areas": [
      "Intellectual Property",
      "Contracts",
      "Media & Entertainment",
      "Art Law"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ayush-sharma",
    "name": "Ayush Sharma",
    "location": "O26A, Jangpura Extension, New Delhi 110017, India",
    "experience": "17 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "911144711249",
    "email": "ayush@mslaw.in",
    "website": "https://mslaw.in/",
    "linkedin": "https://www.linkedin.com/in/ayushsharma",
    "bio": "He is an Advocate on Record (Supreme Court), Registered Patent and Trademark Attorney with about 17 years of experience in active litigation and ancillary services. His is active Litigator having appeared before Supreme Court of India, High Courts and various Tribunals such as NCLAT, NCLT, CESTAT, NCDRC.\nHe has vast experience in representing clients in arbitrations before ad hoc tribunals and High Court.\nHe has represented various clients before Supreme Court, High Courts and District Courts in litigation pertaining to Intellectual Property Rights, such as Patents, Trademarks, Industrial Designs and Copyrights.\nHe has also represented clients before investigating agencies such as CBI, ED & EOW in investigations under the Prevention of Corruption Act and the Prevention of Money Laundering Act. He has also represented clients before adjudicating authorities such as SEBI in various proceedings.\nHe has conducted numerous trials, cross examinations and has been instrumental in preparing witnesses for cross examinations.\nHe conducts due diligence of Intellectual Property Portfolios of organizations in various sectors such as Medical Equipment, renewable energy, automobiles, pharmaceuticals etc. He also provides freedom to operate / infringement and invalidity opinions apart from advising clients on Licensing and Intellectual Property Management.\nHe has extensive experience in drafting and negotiating contracts, litigating disputes in content driven industry and intellectual property. He has worked on various Production contracts, Recording contracts, Artist Management deals, Model Management Contracts, Agreements for licensing of TV shows & animated series, Opinions on regulatory matters, Sponsorship Contracts.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "Bankruptcy & Insolvency",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/chandan-kumar",
    "name": "Chandan Kumar",
    "location": "Choudhary & Associates Palkot House -2 1st Floor, Opp R.B.Springdale School , Lake Road Ranchi 834001 India",
    "experience": "15 years of experience.",
    "languages": [
      "Bengali\nEnglish\nHindi\nMaithili"
    ],
    "phone": "919905532399",
    "email": "advocate.chandanchoudhary@gmail.com",
    "website": "https://choudharyassociates.in/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/chandan-kumar&title=Chandan%20Kumar&summary=Chandan%20Kumar&source=Chandan%20Kumar",
    "bio": "We specialize in services for Family matter, Divorce and child custody, Marriage Registration, Court marriage, consumer cases matter, Banking matter , DRT matter, property registration , Notary public by Government  of India, any document attestation and certify Flat, Villa, Duplex and Land registry Tax matter, Gst Registration and Income tax Return filing, Appeal, Revision, Intellectual property rights, patents, trademarks, copyrights and many more fields through our highly trained professionals.\nWe, Adv. Chandan Kumar, situated at Ranchi, Jharkhand, are a one stop shop offering a wide array of legal services. We work professionally and ethically with a result oriented approach. We are strongly dedicated to our work and our services are remarkable. Our charges are very affordable.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "POSH Advisory",
      "Matrimonial Disputes",
      "Divorce",
      "White Collar Crimes",
      "Criminal Law",
      "Taxation",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Mediation & Conciliation",
      "Environmental Law",
      "Real Estate",
      "Property Law",
      "Animal Law",
      "Constitutional Law",
      "Civil Litigation",
      "Telecom Law",
      "Data Privacy & Protection",
      "Regulatory & Securities",
      "Infrastructure & Projects",
      "Corporate Secretarial",
      "Artificial Intelligence",
      "Asset Management & Funds",
      "Banking & Finance",
      "Funding Advisory",
      "NRI Legal Assistance",
      "Succession & Estate Planning",
      "Tenders & Government Procurement",
      "Domestic & Foreign Investment",
      "Negotiation",
      "Business Law",
      "Service Law",
      "Legal Advisory & Consultancy",
      "Risk Assessment & Management",
      "Admiralty Law",
      "Private International Law",
      "Armed Forces Law"
    ],
    "forums_of_practice": [
      "High Court of Delhi",
      "Tis Hazari Court",
      "Karkardooma Court",
      "Dwarka Court",
      "Rouse Avenue Court",
      "Jharkhand High Court",
      "Saket Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/danesh-homyar-gardin%E2%80%8B",
    "name": "Danesh Homyar Gardin",
    "location": "Bangalore",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919972348808",
    "email": "danesh@mayalaw.in",
    "website": "https://mayalaw.in/",
    "linkedin": "https://www.linkedin.com/in/danesh-gardin/",
    "bio": "Danesh Homyar Gardin is an accomplished corporate attorney with expertise in domestic and cross-border transactions. He is recognised for his ability to navigate complex legal issues and find practical solutions to challenging problems. Danesh has a proven track record of providing strategic counsel to clients in India and abroad, across diverse industries such as finance, technology, education, and healthcare. His passion for his work, attention to detail, and strategic thinking have earned him a reputation as a trusted advisor among his clients. Danesh’s unparalleled dedication and unwavering focus on delivering excellence makes him an invaluable asset to his clients.",
    "practice_areas": [
      "Employment & Labour Laws",
      "Intellectual Property",
      "Start-up Advisory & Compliance",
      "General Corporate",
      "Private Equity & Venture Capital",
      "Dispute Resolution",
      "Banking & Finance",
      "Business Law",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/dhwani-mehta",
    "name": "Dhwani Mehta",
    "location": "201, Unique Tower, Gaiwadi Road, Opp. Mahesh Nagar, Goregaon (West), Mumbai-400104",
    "experience": "10 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919967012539",
    "email": "mehta.dhwani@gmlegal.co.in",
    "website": "https://gmlegal.co.in/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/dhwani-mehta&title=Dhwani%20Mehta&summary=Dhwani%20Mehta&source=Dhwani%20Mehta",
    "bio": "Dhwani Mehta is a qualified B.L.S. L L.B. degree holder and a member of Bar Council of Maharashtra & Goa. She has over 10 years of experience in the real estate & infrastructure sector.\nHer main forte is the real estate sector including redevelopment projects of society, MHADA, slum etc. Her area of practice is not only limited to drafting and vetting of legal documents but also carrying out title verifications, registration of projects with RERA, deemed conveyance, due diligence, sales and purchases, development agreements, permanent alternate accommodation agreements, agreements for sale etc.\nHer other areas of practice include contract drafting and review, contract administration of Corporate Commercial and Real Estate sectors.",
    "practice_areas": [
      "Family Law",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Criminal Law",
      "Taxation",
      "Bankruptcy & Insolvency",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Capital Markets",
      "Dispute Resolution",
      "Banking & Finance",
      "Business Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/dr-prashant-mali",
    "name": "Dr. Prashant Mali",
    "location": "A902, Grenville CHS, Lokhandwala Complex, Lion Sol Marg, Andheri West, Maharashtra, India, Pincode 400053",
    "experience": "25 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919821763156",
    "email": "prashant.mali@cyberlawconsulting.com",
    "website": "https://www.prashantmali.com/home",
    "linkedin": "https://www.linkedin.com/in/prashantmali/",
    "bio": "Prashant Mali is a famous International Cybersecurity, Cyber Law, Data Protection Expert Lawyer, Thought leader, and TV Personality. He practices cybercrime, Data Protection Law, AI, Blockchain, Fintech, E-commerce, Financial & EOW crimes, Trademarks, Copyright, Consumer Law, IPR and Electronic Evidence. A Practising Bombay High Court Lawyer and Legal Counsel in Mumbai, India. When he started he was the country's only technology lawyer with prior working experience in the IT Industry & then in the Law Field with Qualifications as Master in Computer Science (M.Sc.), Master in Law (LLM), Ph.D. in International Cyber Law and Cyber Warfare, Certified Computer Forensics Expert (CCFP). He has 25 years of experience. He is a published author and has authored 8 books on Cyber Law, Cyber Crime, Data Protection Law, GDPR, authored 16 research papers,  and has written articles in all leading magazines and newspapers of India. He is Interviewed by Television News Channels like BBC World, Zee Business News, NDTV Profit, Bloomberg, etc. Cybercrime lawyer could be just another professional name. He practices in both criminal and civil courts. He has got many landmark judgments in the form of Acquittals & orders before various courts. He is also a sought-after International Speaker on Cyber Security, Cyber Crime, Data Protection law, Cyberwarfare, International Cyber Law, Privacy Law, IPR, Electronic evidence etc. He Provides Expert Legal Opinion on e-commerce, blockchain, fintech, Cloud computing, Electronic signatures, web3, IOT, AI, ML, Robotics, Cyber Law or The IT Act,2000, the DPDP Act, CCPA and GDPR matters and appears before Various Courts as Expert Counsel for Government agencies, Companies and Individuals. He was invited to Oxford University to present a paper on \"Cyber Terrorism & International Law\". He is also a Chevening (UK) Cyber Security Policy Fellow for 2015. He is a participant of IVLP (USA) for Linking Digital Policy to Cyber Crime Enforcement. His Policy-related advice and thoughts are endorsed by various governments and are implemented in Laws and Rules framed.",
    "practice_areas": [
      "Intellectual Property",
      "White Collar Crimes",
      "Criminal Law",
      "Media & Entertainment",
      "Civil Litigation",
      "Telecom Law",
      "Cyber Law",
      "Data Privacy & Protection",
      "Dispute Resolution",
      "Artificial Intelligence",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [
      "Bombay High Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/fateh-law-corporation",
    "name": "Fateh Law Corporation",
    "location": "516, Sector 11-B, Chandigarh 160011",
    "experience": "years of experience.",
    "languages": [],
    "phone": "9875950786",
    "email": "fatehnavratan@gmail.com",
    "website": "https://navratanfateh.com/",
    "linkedin": "https://www.linkedin.com/in/navratan-fateh-ba333a281",
    "bio": "Fateh Law Corporation is a leading Canadian immigration law firm dedicated to providing legal services in immigration law. With the unique capability to serve clients in both Canada and India, we are the only Canadian immigration lawyer team with a permanent office in Chandigarh, India. This ensures that quality Canadian immigration services are easily accessible to clients based in India, offering a smooth and efficient cross-border experience.\nUnder the leadership of Mr. Navratan Singh Fateh, a highly experienced Canadian immigration lawyer with over 10 years of litigation background, our firm focuses on addressing delayed or adverse decisions by Immigration, Refugees, and Citizenship Canada (IRCC) through the Federal Court of Canada and Canadian tribunals. Mr. Fateh’s dual qualification as an Indian Advocate and Canadian Barrister and Solicitor uniquely enables our firm to provide comprehensive insights and customized legal solutions across both jurisdictions.\nWhether assisting individuals or businesses with Canadian immigration processes, Fateh Law Corporation is your trusted partner for navigating complex immigration matters with clarity and confidence.",
    "practice_areas": [
      "Arbitration Law"
    ],
    "forums_of_practice": [
      "Supreme Court of India"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/firuz-khan",
    "name": "Firuz Khan",
    "location": "House No. 4, Bye lane 1, Bishnujyoti Path, Bakrapara, Basistha Chariali, Guwahati - 781029, Assam, India",
    "experience": "10 years of experience.",
    "languages": [
      "English\nHindi\nUrdu"
    ],
    "phone": "917002611014",
    "email": "advocatefiruzkhan@gmail.com",
    "website": "https://advocatefiruzkhan.com/",
    "linkedin": "https://www.linkedin.com/in/firuz-khan-152bb2b6/",
    "bio": "Firuz Khan is an advocate registered with The Bar Council of Assam, Nagaland, Mizoram, Arunachal Pradesh & Sikkim. He is a member of the Supreme Court Bar Association and Gauhati High Court Bar Association. He is practising at Gauhati High Court since 2013 and also takes up cases in the Supreme Court of India, CBI Court, CJM Court, Sessions Court, Special Court, Tribunals and all District Courts in Assam. He has specialization in handling cases pertaining to Writ Petitions, Divorce Matters, Anti-Corruption, Trap Cases, NDPS cases, Bail Matters, Service matters, Maintenance Cases, Muslim Law, Domestic violence cases, as well as Civil and Criminal trials.",
    "practice_areas": [
      "Divorce",
      "Criminal Law",
      "Civil Litigation",
      "Dispute Resolution",
      "Service Law"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "Guwahati High Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/gagan-gandhi",
    "name": "Gagan Gandhi",
    "location": "H-74, Block H, Kirti Nagar, New Delhi, Delhi 110015",
    "experience": "7 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919818085505",
    "email": "info@nitinyaya.com",
    "website": "https://nitinyaya.com/",
    "linkedin": "https://www.linkedin.com/in/gagan-gandhi-62993a9/?originalSubdomain=in",
    "bio": "Gagan Gandhi after doing his graduation in Mathematics and Statistics from St Stephen’s College worked in American Express (P) Ltd in their Risk and Information Department before he decided to do Law from Faculty of Law, University of Delhi. He is author of various research paper(s) and case studies in Journal of Advances in Management published by Emerald. With strong conflict resolution skills he has been instrumental in contribution to the field of law through “Webinars” on contemporary topics.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Matrimonial Disputes",
      "Criminal Law",
      "Taxation",
      "Contracts",
      "Mediation & Conciliation",
      "Mergers & Acquisitions",
      "Real Estate",
      "Property Law",
      "Banking & Finance"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/gagan-oberoi",
    "name": "Gagan Oberoi",
    "location": "Chamber No. 96, Punjab & Haryana High Court, Chandigarh – 160001",
    "experience": "16 years of experience.",
    "languages": [
      "English\nHindi\nPunjabi"
    ],
    "phone": "919781270007",
    "email": "gagan@oberoilawchambers.com",
    "website": "https://www.oberoilawchambers.com/",
    "linkedin": "https://www.linkedin.com/in/gagan-oberoi/",
    "bio": "With over 16 years of core advocacy and litigation experience, Adv. Gagan Oberoi has a flair for all kinds of civil, criminal, corporate, constitutional, matrimonial, real estate, and banking matters before the Supreme Court of India, Punjab & Haryana High Court, Nainital High Court, Delhi High Court, and various other High Courts in India. He caters to domestic and foreign clients from the firm’s offices in New Delhi, Chandigarh, Dehradun, and Ludhiana.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Motor Accidents",
      "Company Registration",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "White Collar Crimes",
      "Mediation & Conciliation",
      "Start-up Advisory & Compliance",
      "General Corporate"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "Uttarakhand High Court",
      "Punjab & Haryana High Court",
      "District & Sessions Court, Gurugram"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/gopal-kumar",
    "name": "Gopal Kumar",
    "location": "Ward No-25, Baghi, Near Shiv Mandir, Begusarai",
    "experience": "5 years of experience.",
    "languages": [
      "Bhojpuri\nEnglish\nHindi\nMaithili"
    ],
    "phone": "918292589402",
    "email": "gopalmmpl@gmail.com",
    "website": "https://www.lawyersahab.in/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/gopal-kumar&title=Gopal%20Kumar&summary=Gopal%20Kumar&source=Gopal%20Kumar",
    "bio": "With a steadfast commitment to upholding justice and advocating for the rights of my clients, I am Advocate Gopal Kumar. I specialize in providing strategic counsel and representation to individuals and businesses navigating complex legal matters.\nDriven by a passion for the law and a dedication to serving my clients' best interests, I approach each case with meticulous attention to detail and a relentless pursuit of favorable outcomes. My extensive experience encompasses a wide range of Civil and Criminal matters.\nAt the core of my practice is a commitment to integrity, professionalism, and ethical conduct. I believe in fostering open communication with my clients, empowering them with the knowledge and guidance needed to make informed decisions throughout the legal process. Whether representing individuals, families, or businesses, I strive to deliver personalized legal solutions tailored to each client's unique needs and objectives.\nClient-Centric Approach:\nRecognizing that legal challenges can be daunting, I prioritize accessibility and responsiveness, ensuring that my clients receive the support and advocacy they deserve. From the initial consultation to the resolution of their case, I am steadfastly dedicated to providing compassionate guidance, unwavering support, and zealous representation every step of the way.\nAs a trusted legal advisor and advocate, I am committed to achieving the best possible outcomes for my clients while upholding the principles of justice and fairness. Whether you are facing a complex legal dispute, seeking proactive legal counsel, or simply in need of guidance, I am here to help. Contact me today to schedule a consultation and learn how I can assist you with your legal needs.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Family Law",
      "Motor Accidents",
      "Company Registration",
      "Matrimonial Disputes",
      "Divorce",
      "Criminal Law",
      "Taxation",
      "Contracts",
      "Insurance Law",
      "Mediation & Conciliation",
      "Environmental Law",
      "Real Estate",
      "Property Law",
      "Human Rights Law",
      "Civil Litigation",
      "Debt Recovery",
      "Telecom Law",
      "Cyber Law",
      "Infrastructure & Projects",
      "Project Finance",
      "Artificial Intelligence",
      "Banking & Finance",
      "Funding Advisory",
      "NRI Legal Assistance",
      "Electricity & Energy",
      "Negotiation",
      "Business Law",
      "Service Law",
      "Legal Advisory & Consultancy",
      "Commercial Litigation",
      "Risk Assessment & Management"
    ],
    "forums_of_practice": [
      "Allahabad High Court",
      "Patna High Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/harsh-gupta",
    "name": "Harsh Gupta",
    "location": "6, BizOffice, First Floor, Nehru Nagar Main Road, Near Agrasen Chowk, Bhilai (C.G)- 490020",
    "experience": "3 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "917869063518",
    "email": "harsh@pranshlaw.com",
    "website": "https://www.pranshlaw.com/",
    "linkedin": "https://www.linkedin.com/in/harsh-gupta-59b632208?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app",
    "bio": "Harsh Gupta is a 2020 law graduate from Hidayatullah National Law University, Raipur. To specialise in commerical and company law(s), he completed his post graduation in CS from Institue of Company Secretary of India in November 2021 and is also a licentiate member of ICSI.\nBeing inclined towards litigation, Harsh enrolled himself with the bar and joined Pransh Law Offices, Raipur in February 2022 and has been working with the firm since then. He has been handling matters relating to Arbitration, Commercial & Company law(s), Consumer Laws and MSME.\nHe along with Harshita Gupta has also opened up a branch of Pransh Law offices in Bhilai.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Start-up Advisory & Compliance",
      "Business Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Chattisgarh High Court",
      "Real Estate Regulatory Authortity (RERA), Chattisgarh"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/harsh-vardhan",
    "name": "Harsh Vardhan",
    "location": "6/33-B, L.G.F., JANGPURA, BLOCK-B, NEW DELHI - 110014.",
    "experience": "8 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919958559119",
    "email": "info@zlc.co.in",
    "website": "https://zlc.co.in/",
    "linkedin": "https://www.linkedin.com/in/harsh-vardhan-43336198/",
    "bio": "Harsh has expertise in corporate and commercial laws relating to Insolvency, Corporate Commercial Advisory, and Recovery proceedings. He started his professional journey with a litigation and thereafter started his own independent practice. He has represented clients before the Supreme Court of India, High Courts and Tribunals of various states including District Courts. He regularly appears before various tribunals across Delhi NCR and has mastery in recovery matters, insolvency law and consumer laws and has been active stimulant for achieving settlements in various litigations.\nHarsh has vast experience in drafting and handling Special Leave Petitions, Writ Petitions, Civil Suits, Civil Appeals, Civil Revision Petitions, Original Applications before DRT, Cyber Complaints, Press Council of India, Labour Complaints under various labour laws, Consumer Complaints, Consumer Appeals, Revisions, RERA Complaints, RERA Appeals and Criminal Complaints not only limited to Complaints under Section 138 of the Negotiable Instruments Act etc.\nHarsh also has extensive experience in conducting due diligence for corporate clients. He has advised clients on various documents such as title deeds, land records etc. Apart from the above he has also advised clients on due diligence of corporate documents and matters pertaining to intellectual property. He is also involved in various probono work involving the protection of the rights of the consumers and labour.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "Criminal Law",
      "Real Estate",
      "Civil Litigation",
      "Cyber Law",
      "Dispute Resolution",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "Real Estate Regulatory Authortity (RERA), Delhi"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/harshita-gupta",
    "name": "Harshita Gupta",
    "location": "6, BizOffice, First Floor, Nehru Nagar Main Road, Near Agrasen Chowk, Bhilai (C.G)- 490020",
    "experience": "3 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "917999467552",
    "email": "harshita@pranshlaw.com",
    "website": "https://www.pranshlaw.com/",
    "linkedin": "https://www.linkedin.com/in/advocate-harshita-gupta-148884111?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app",
    "bio": "Harshita Gupta completed her Graduation in BA.LLB (Hons.) from Hidayatullah National Law University, Raipur and Post-Graduation in CS from the Institute of Company Secretaries of India. She is also a Licentiate Member of ICSI while being enrolled with the Bar. She started her career with Shekhar Srivastava and Associates where she worked for more than a year. Thereafter, she joined Abhinav Kardekar & Partners and after completing her 17 months tenure there, she joined Pransh Law. In association with Pransh Law, she has opened a new branch office in Bhilai and is currently heading the same.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Real Estate",
      "Property Law",
      "Business Law"
    ],
    "forums_of_practice": [
      "Chattisgarh High Court",
      "Real Estate Regulatory Authortity (RERA), Chattisgarh"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/j-priyadarshni",
    "name": "J. Priyadarshni",
    "location": "Westend Marg, Saidulajab, Saiyad ul Ajaib, Saket, New Delhi, Delhi, India",
    "experience": "years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "918178337665",
    "email": "priyadarshni@smarthalegal.co.in",
    "website": "https://smarthalegal.com/",
    "linkedin": "https://www.linkedin.com/in/j-priyadarshni?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
    "bio": "Ms. J.Priyadarshni completed her B.B.A LL.B from Bharati Vidyapeeth's New Law College, Pune, Maharashtra. She holds a Diploma in Corporate Law from Bharati Vidyapeeth University, Pune. Priyadarshni is a member of the Bar Council of Delhi.  Her practice areas are Litigation, Corporate, Data privacy, Trademark, International Business Law, and Copyright.\nPriyadarshni represents clients before the Supreme Court of India, High Courts, Civil, and Criminal Courts, NCLT, DRT, Consumer forums, and other Courts and Tribunals. She also deals with claims pertaining to violation of advertisement, and broadcasting code violations before ASCI, and NBDA. Besides, Ms. Priyadarshni is committed to making justice accessible to all. She is a panel Advocate for State Legal Services Authority.\nPriyadarshni has corporate commercial practice, which, majorly includes contract drafting and negotiations, statutory compliances, corporate advisory, and due diligence. She has extensive knowledge and experience in serving Startups and corporates. She has provided legal guidance to various successful Startups.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "Mediation & Conciliation",
      "General Corporate",
      "Data Privacy & Protection",
      "Business Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/jaya-kumari",
    "name": "Jaya Kumari",
    "location": "Dehradun",
    "experience": "2 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919115170777",
    "email": "jaya@oberoilawchambers.com",
    "website": "https://oberoilawchambers.com/",
    "linkedin": "https://www.linkedin.com/mwlite/in/adv-jaya-kumari-28132119a",
    "bio": "Jaya Kumari is a well-rounded advocate who earned her law degree from Dehradun and has been practicing at the Punjab and Haryana High Court and the Supreme Court of India since 2022. Her expertise in litigation has also allowed her to appear before the Nainital High Court, further solidifying her reputation as a highly skilled and versatile legal professional.\nWith her extensive experience in civil, criminal, corporate, banking and diverse litigation, Jaya is well equipped to handle a wide range of legal cases and disputes. Her tireless work ethic, passion for justice, and unwavering commitment to her clients make her a valuable asset to Oberoi Law Chambers and a respected member of the legal community.\nJaya’s exceptional communication skills, combined with her deep understanding of the law, have earned her a reputation as a skilled negotiator and effective advocate. She always puts her clients’ interests first and works tirelessly to ensure that they receive the best possible outcome in each case.\nShe is a highly skilled and experienced advocate who has made a significant impact on the legal landscape. Her passion for justice, dedication to her clients, and unwavering commitment to the law make her a true asset to the legal profession.",
    "practice_areas": [
      "Civil Litigation",
      "Dispute Resolution",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [
      "Uttarakhand High Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/joydev-sengupta",
    "name": "Joydev Sengupta",
    "location": "Unit-917, 9th Floor, Delta House, 4, Government Place (N), Kolkata-700001",
    "experience": "24 years of experience.",
    "languages": [
      "Bengali\nEnglish\nHindi"
    ],
    "phone": "919830014545",
    "email": "jsgkolkata@jsglegal.in",
    "website": "https://jsglegal.in/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/joydev-sengupta&title=Joydev%20Sengupta&summary=Joydev%20Sengupta&source=Joydev%20Sengupta",
    "bio": "Mr. Joydev Sengupta is a Corporate Law Professional with over 24 years of experience in corporate and related laws. By qualification, he is an LLB, FCS, MBA (Fin.), an Insolvency Professional, an ICADR Certified Mediator.\nHis competency and expertise lie in corporate laws, financial laws and private laws. He advises on corporate secretarial and governance advisory, contract drafting and management, intellectual property laws, insolvency and bankruptcy laws, start up solutions, dispute resolutions, employment laws, PE and other modes of equity funding, IPO, anti-trust laws, legal metrology, financial market advisory cross-border establishments private assistance.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Employment & Labour Laws",
      "Intellectual Property",
      "Criminal Law",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Start-up Advisory & Compliance",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Private Equity & Venture Capital",
      "Dispute Resolution",
      "Restructuring",
      "Corporate Secretarial",
      "Competition & Anti-trust",
      "Business Law"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/k-k-palanisaami",
    "name": "K K Palanisaami",
    "location": "112, Coperative Colony, Near Ayyappan Temple, Mohanur Road, Namakkal, Tamil Nadu",
    "experience": "28 years of experience.",
    "languages": [
      "English\nHindi\nKannada\nMalyalam\nTamil\nTelegu"
    ],
    "phone": "09443266789",
    "email": "palanisaami2020@gmail.com",
    "website": "https://www.justdial.com/Namakkal/K-K-Palanisaami-Law-Associates-Near-Iyyappan-Temple-TPN-Petrol-Bunk-South-Street-Namakkal-Ho/9999P4286-4286-130402173011-P4U2_BZDET",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/k-k-palanisaami&title=K%20K%20Palanisaami&summary=K%20K%20Palanisaami&source=K%20K%20Palanisaami",
    "bio": "I am a leading advocate in Tamil Nadu.",
    "practice_areas": [
      "Arbitration Law",
      "Banking & Finance"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/kanika-prakash",
    "name": "Kanika Prakash",
    "location": "603/9, Shahdara, Delhi -110032",
    "experience": "3 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "9643875271",
    "email": "advkanikaprakash@gmail.com",
    "website": "https://www.scaleuplegal.in/",
    "linkedin": "https://www.linkedin.com/in/advkanikaprakash",
    "bio": "At Scaleup Legal Law Offices, we provide strategic, practical, and client-focused legal solutions. Our firm, founded by Kanika Prakash, specializes in catering to startups, businesses, and individuals, offering expert legal guidance across multiple practice areas. With a strong foundation in Intellectual Property, Corporate Law, and Dispute Resolution, we help clients navigate complex legal challenges with confidence.\nOur Practice Areas\n· Intellectual Property – Protecting innovations through trademarks, copyrights, patents, and IP enforcement strategies.\n· Startups & Compliance – Assisting startups with business formation, regulatory compliance, investment agreements, and policy structuring.\n· Corporate & Commercial Law – Advising businesses on contracts, commercial transactions, and regulatory frameworks.\n· Real Estate & Property Law – Handling property transactions, lease agreements, real estate disputes, and due diligence.\n· Family & Matrimonial Law – Providing legal support in divorce, alimony, child custody, succession, and inheritance matters.\n· Dispute Resolution & Litigation – Representing clients in civil, commercial, and contractual disputes through litigation, mediation, and arbitration.\n· Insolvency & Bankruptcy – Advising clients on insolvency proceedings, debt recovery, restructuring, and bankruptcy laws.\n· Scaleup Legal, we are driven by the principles of trust, integrity, and legal excellence. Whether you are a startup, a business, or an individual seeking legal counsel, we are here to provide tailored legal solutions to safeguard your rights and interests.\nGet in touch with us today to discuss your legal needs.",
    "practice_areas": [
      "Family Law",
      "Company Registration",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Start-up Advisory & Compliance",
      "Property Law",
      "Debt Recovery",
      "Dispute Resolution",
      "Corporate Secretarial",
      "Due Diligence",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "Tis Hazari Court",
      "Patiala House Court",
      "Rouse Avenue Court",
      "National Company Law Tribunal (NCLT)",
      "National Green Tribunal (NGT)",
      "Saket Court",
      "National Company Law Appellate Tribunal (NCLAT)",
      "Debts Recovery Tribunal, Delhi",
      "National Consumer Disputes Redressal Commission",
      "State Consumer Disputes Redressal Commission, Delhi",
      "Real Estate Regulatory Authortity (RERA), Delhi",
      "Rohini District Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/kaushik-sochannam",
    "name": "Kaushik Sochannam",
    "location": "",
    "experience": "16 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919833264577",
    "email": "kaushik@sochannamlegal.com",
    "website": "https://www.sochannamlegal.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/kaushik-sochannam&title=Kaushik%20Sochannam&summary=Kaushik%20Sochannam&source=Kaushik%20Sochannam",
    "bio": "Shipping & Maritime Lawyer | Insurance Law Specialist | Expert in Dispute Resolution and Global Business Advisory\nKaushik is a dedicated shipping and maritime lawyer with a focus on dry and wet matters, insurance law, commercial law and transport-related matters. Kaushik focuses on offering practical legal solutions that protect clients' interests. His experience includes:\nKaushik is recognized for his practical, solution-oriented approach, making him a trusted advisor to P&I clubs, shipowners, charterers, commodity traders, and trading houses.\nBackground:\nPrior to founding Sochannam Legal in 2013, Kaushik gained invaluable experience at a leading Mumbai law firm associated with a renowned English law firm specializing in shipping and international trade. He further honed his expertise during his training at a prominent barrister’s chamber focusing on maritime and insurance law.",
    "practice_areas": [
      "Arbitration Law",
      "Company Registration",
      "Contracts",
      "Insurance Law",
      "Marine & Shipping Law",
      "General Corporate",
      "Dispute Resolution",
      "Banking & Finance",
      "Business Law",
      "Commercial Litigation",
      "Admiralty Law",
      "International Trade"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/keshav-thakur",
    "name": "Keshav Thakur",
    "location": "245-A, Puran Nagar, Jammu, Jammu and Kashmir 180006",
    "experience": "28 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "9111416003880",
    "email": "email@keshavthakur.com",
    "website": "https://keshavthakur.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/keshav-thakur&title=Keshav%20Thakur&summary=Keshav%20Thakur&source=Keshav%20Thakur",
    "bio": "Keshav Thakur is a highly experienced and accomplished law graduate from Campus Law Centre, Delhi University. With over 28 years of legal standing, Mr. Keshav Thakur has practiced in various courts, including the District Courts, J&K, Delhi High Court, and Hon’ble Supreme Court. Mr. Thakur has extensive experience in Civil, Criminal, Constitution, Company, Service, and IPR Laws, with over 100 reported and 250 unreported judgments to their credit. Mr. Thakur has been appointed as Amicus Curiae by the Supreme Court and represented various departments of the Government of India, particularly the Ministry of Defence, Railways, and the CBI, for eight years. With such vast experience, Mr. Thakur is an expert in their field and can provide invaluable legal counsel to clients.",
    "practice_areas": [
      "Arbitration Law",
      "Family Law",
      "Employment & Labour Laws",
      "Intellectual Property",
      "Criminal Law",
      "Real Estate",
      "Civil Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/khevana-dagli",
    "name": "Khevana Dagli",
    "location": "Office No. 17, BMC Building, Behind Darshan Classic CHS, Near Unity Bank, J.B. Nagar, Andheri East, Mumbai - 400099",
    "experience": "10 years of experience.",
    "languages": [
      "English\nGujarati\nHindi\nMarathi"
    ],
    "phone": "9167514777",
    "email": "khevanadagli@gmail.com",
    "website": null,
    "linkedin": "http://www.linkedin.com/in/khevanadagli",
    "bio": "Advocate Khevana Dagli is a highly respected litigation lawyer based in Mumbai, with a specialized practice in divorce, mutual consent separation, domestic violence, child custody, criminal defence, and civil litigation. Recognised among the top divorce and criminal lawyers in Mumbai, she is known for her fearless courtroom presence, client-first approach, and ability to handle emotionally intense cases with professionalism and empathy.\nWhether you're facing a contested divorce, seeking a mutual consent divorce, fighting for child custody, defending a false criminal case, or handling a property dispute with builders or family — Khevana is the lawyer who listens without judgment and acts with precision.\nShe regularly appears before the Family Courts, Magistrate Courts, Sessions Courts, and the Bombay High Court, offering experienced legal counsel across jurisdictions.",
    "practice_areas": [
      "Family Law",
      "Matrimonial Disputes",
      "Divorce",
      "Criminal Law",
      "Property Law",
      "NRI Legal Assistance",
      "Succession & Estate Planning",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "Bombay High Court",
      "Esplanade Court",
      "Mulund Court",
      "Real Estate Regulatory Authortity (RERA), Maharashtra",
      "Thane Sessions and District Court",
      "Bandra Family Court",
      "City Civil & Sessions Court, Bombay",
      "Pune Sessions Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/kishan-dutt-kalaskar",
    "name": "KISHAN DUTT KALASKAR",
    "location": "No.74, 1st Floor, 6th Cross, Malleswaram, Bengaluru",
    "experience": "40 years of experience.",
    "languages": [
      "English\nHindi\nKannada\nTelegu\nUrdu"
    ],
    "phone": "09686971935",
    "email": "kalaskarnetra@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/kishan-dutt-kalaskar&title=KISHAN%20DUTT%20KALASKAR&summary=KISHAN%20DUTT%20KALASKAR&source=KISHAN%20DUTT%20KALASKAR",
    "bio": "About Advocate Kishan Dutt Kalaskar\n20 years service as Judge in different capacities. Read and prepared Head Notes for more than 10,000 judgments of different High Courts and Supreme Court. Head Notes published by various Law Publishers. Now preparing Head notes for www.scconline.com.\nWorked in different capacities and dealt with several categories of cases. Having practical knowledge of law in practice and drafting and counselling.",
    "practice_areas": [
      "Family Law",
      "Divorce",
      "Criminal Law",
      "Civil Litigation"
    ],
    "forums_of_practice": [
      "High Court of Karnataka"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/kotresh-hubballi",
    "name": "Kotresh Hubballi",
    "location": "Maniyar Building Near Dharwad City Post Office, Gandhi Chowk, Dharwad-580001",
    "experience": "7 years of experience.",
    "languages": [
      "English\nHindi\nKannada"
    ],
    "phone": "9535866455",
    "email": "khubballi89@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/kotresh-hubballi&title=Kotresh%20Hubballi&summary=Kotresh%20Hubballi&source=Kotresh%20Hubballi",
    "bio": "I'm an advocate practicing since 7 and half years at trial courts of Hubballi-Dharwad twin City. I also practice before Consumer Commission and High Court of Karnataka, Dharwad Bench.\nI majorly handle Civil and Criminal Litigation, Writ and Service Matters.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Motor Accidents",
      "Employment & Labour Laws",
      "Intellectual Property",
      "Matrimonial Disputes",
      "White Collar Crimes",
      "Criminal Law",
      "Contracts",
      "Insurance Law",
      "Environmental Law",
      "Real Estate",
      "Property Law",
      "Human Rights Law",
      "Constitutional Law",
      "Civil Litigation",
      "Cyber Law",
      "Succession & Estate Planning",
      "Electricity & Energy",
      "Service Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Debts Recovery Tribunal, Bangalore",
      "Real Estate Regulatory Authortity (RERA), Karnataka",
      "High Court of Karnataka"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/kp-sivaramakrishnan",
    "name": "KP Sivaramakrishnan",
    "location": "",
    "experience": "7 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919811573568",
    "email": "siva@sloffices.in",
    "website": "https://sloffices.in/",
    "linkedin": "https://www.linkedin.com/in/sivaramakrishnankp/",
    "bio": "Meet Mr. K P Sivaramakrishnan, or Siva, as he is affectionately known among his clients and colleagues, is an accomplished Intellectual Property expert. With a rich experience in the field since 2016, he has worked with top law firms, broadcasting channels. His extensive experience covers various industries, including entertainment, packaging, FMCG, healthcare, and finance, where he has a proven track record of resolving IP-related disputes effectively.\nHe transitioned from a career as a musician and music producer, to practicing law. During his time in law school, he recognized the lack of awareness and low access to proper legal assistance for artists and production companies. This inspired him to specialise in Intellectual Property Rights and contracts law.\nSiva takes an unconventional approach to serve his clients by going beyond the regular responsibilities of a lawyer. He has helped brands to create their trade marks/brand names and assisted their marketing teams in preparing brand strategies. Moreover, he has successfully negotiated deals ranging from associations with giant alcohol brands to representing artists before music distributors and labels during their album/song releases.\nOn the academic front, Mr. Sivaramakrishnan has featured in webinars and online forums, where he was seen sharing his experiences with young legal minds and providing them with an open understanding of the field. He has also conducted seminars in colleges to provide a unique perspective on IPR in today’s time.\nSiva’s expertise was well-recognized, when he was credited as the legal advisor for a feature film. He works closely with Bollywood singers, musicians and publishers to understand the current status of royalties and benefits for artists in the music industry.\nPartner with Mr. Sivaramakrishnan to ensure your intellectual property rights are safeguarded, and your business interests are protected.",
    "practice_areas": [
      "Intellectual Property",
      "Contracts",
      "Negotiation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/kushal-bhardwaz",
    "name": "Kushal Bhardwaz",
    "location": "Chamber no.B-56, District and Sessions Court, Gurugram",
    "experience": "8 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "917834840003",
    "email": "bhardwazkushal@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/kushal-bhardwaz&title=Kushal%20Bhardwaz&summary=Kushal%20Bhardwaz&source=Kushal%20Bhardwaz",
    "bio": "I started practicing in the year 2016 and since then I have established an excellent reputation for integrity and value-based proactive, pragmatic and innovative legal advice and ability to help clients effectively. I believe in establishing strong and enduring relationships with clients by ensuring that i am always available to attend to our clients’ needs. It is always my endeavour to understand client’s goals. I am transparent in my working, and commit myself to time-bound and cost-effective advice that protects client’s interests every time. My commitment towards the clients and work, attention to detail, transparent approach and formidable expertise in various areas of civil, Criminal and commercial law. Matrimonial law has helped me not just to gather but also to retain good clients.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Motor Accidents",
      "Matrimonial Disputes",
      "Divorce",
      "Criminal Law",
      "Contracts",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Cyber Law",
      "Infrastructure & Projects",
      "Due Diligence",
      "Succession & Estate Planning",
      "Electricity & Energy",
      "Negotiation",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "District & Sessions Court, Gurugram"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/kushal-gupta",
    "name": "Kushal Gupta",
    "location": "C-496 Sector-19 Noida",
    "experience": "2 years of experience.",
    "languages": [
      "English\nHindi\nSanskrit"
    ],
    "phone": "918130337203",
    "email": "akglawchamber@gmail.com",
    "website": "https://lawgearhub.com/",
    "linkedin": "https://linkedin.com/in/kushal-gupta-17a36117b",
    "bio": "Kushal Gupta is an efficient and dedicated professional with a passion for pursuing a career in Dispute Resolution.\nKushal carries an intricate experience of dealing with cases from the side of the Bar, Bench, an Arbitration Institution, and a Law Firm. He has a varied experience of appearing in High Court, various district courts of NCR and various tribunals\nHe has interned under an eminent Professor as a Research Assistant, with top Litigating Counsels from Delhi like Siddharth Luthra and top firms like DSK and Fox Mandal.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Employment & Labour Laws",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "White Collar Crimes",
      "Criminal Law",
      "Contracts",
      "Human Rights Law",
      "Constitutional Law",
      "Sports & Gaming Law",
      "Civil Litigation",
      "Cyber Law",
      "Data Privacy & Protection",
      "Dispute Resolution",
      "Competition & Anti-trust",
      "Service Law",
      "Space Law"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/mac-savaksha-bodhanwalla",
    "name": "Mac Savaksha Bodhanwalla",
    "location": "Motlibai Wadia Building, 1st Floor, Office Nos. 102,104,117 & 118 22D,S A Brelvi Road, Fort, Mumbai- 400 001",
    "experience": "53 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "912249787346",
    "email": "mac@bodhanwallaco.in",
    "website": "https://www.bodhanwallaco.in/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/mac-savaksha-bodhanwalla&title=Mac%20Savaksha%20Bodhanwalla&summary=Mac%20Savaksha%20Bodhanwalla&source=Mac%20Savaksha%20Bodhanwalla",
    "bio": "MR. MAC SAVAKSHA BODHANWALLA graduated from St. Xavier’s College, Bombay.\nPassed the three year LL.B. (Bachelor of Legal Laws (Special) Examination from the Government Law College, Bombay. Enrolled as an Advocate of the Bombay High Court in 1971. Obtained LLM (Master of Legal Laws) degree from the Bombay University in groups II & IV (Company law and international Law) passing both the Groups at the first attempt.\nAfter pursuing his Articleship for the Attorney’s Examination passed the Attorneys/Solicitors Examination at the first attempt and enrolled as an Attorney-at-Law and Solicitor of the Bombay High Court in November, 1975.\nJoined M/s. Smetham Byrne Lambert & Dubash, Solicitors & Advocates and later became a partner in the said firm. Established and founded the firm  M.S. Bodhanwalla & Co., Solicitors & Advocates, in the year 1983.",
    "practice_areas": [
      "Arbitration Law",
      "Family Law",
      "Employment & Labour Laws",
      "Intellectual Property",
      "White Collar Crimes",
      "Media & Entertainment",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Dispute Resolution",
      "Conveyance",
      "Succession & Estate Planning"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/manish-riju",
    "name": "Manish Riju",
    "location": "2nd Floor, Universal Tower, Kurji, Sadaquat Ashram, Patna, Bihar 800010",
    "experience": "7 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919835825578",
    "email": "iptrademarkclinic@gmail.com",
    "website": "https://www.iptrademarkclinic.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/manish-riju&title=Manish%20Riju&summary=Manish%20Riju&source=Manish%20Riju",
    "bio": "Manish Riju is currently practicing as an Advocate based at Patna High Court and District Court of Muzaffarpur, Bihar. He completed his B.A.LL.B (Corporate and Commercial Laws) from Central University of South Bihar and LL.M in Corporate and Commercial Laws from Chanakya National Law University, Patna.\nHis expertise practice area comprises in dealing with Corporate, Criminal and Intellectual Property Law matters.",
    "practice_areas": [
      "Company Registration",
      "Intellectual Property",
      "Criminal Law",
      "General Corporate"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/manojj-biniwalle",
    "name": "Manojj Biniwalle",
    "location": "Rampurawala Building, Office No 142, 1st Floor, Mahatma Gandhi Rd, opposite District Court, Indore, Madhya Pradesh 452001",
    "experience": "20 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919303218011",
    "email": "biniwalle@gmail.com",
    "website": "https://advocatebiniwalleassociatesindore.in/",
    "linkedin": "https://www.linkedin.com/in/advocate-manoj-biniwale-75274324b/?originalSubdomain=in",
    "bio": "Manoj Biniwalle has been providing professional legal services to local and international clients for the last two decades. We are proud to say that we are experts across several practice areas.\nAs a part of our legal work, we are able to deliver our best when our clients confidently turn to us, especially when they are on the verge of breaking. We at Biniwalle Associates, help them with taking legal precautions and finding reliable solutions.\nWe at Biniwalle Associates are committed to being there whenever you need our expertise, and we offer one of the longest initial consultations possible. Our prompt response is always there to answer your legal queries, ease your confusion, getting answers to common legal questions, or assisting with appearing in court for a case.",
    "practice_areas": [
      "Family Law",
      "Matrimonial Disputes",
      "Divorce",
      "Criminal Law",
      "Contracts",
      "Succession & Estate Planning",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/misha-rohatgi-mohta",
    "name": "Misha Rohatgi Mohta",
    "location": "A23, LGF, South Extension - II, Delhi - 110049",
    "experience": "15 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919899705974",
    "email": "misharohagti@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/misha-rohatgi-mohta-55518124a/",
    "bio": "Misha Rohatgi Mohta is a distinguished Supreme Court Advocate-on-Record, with experience handling high stakes commercial and constitutional matters before the SC, high courts, NCLT, appellate tribunal, Competition Commission of India, and arbitral tribunals.\nWith a strong research background under the guidance of the Late Honorable Mr. Justice Valmiki Mehta and Private International Law credentials earned at the Hague Academy of International Law, Misha tackles complex legal issues that shape jurisprudence.\nShe has a record representing diverse clients, including major companies in sectors like Fintech, chemical, steel and mining, power, FMCG, and retail. Nakul's expertise also covers public servants and government parties, handling cases with significant impact on state governments.",
    "practice_areas": [
      "Arbitration Law",
      "Employment & Labour Laws",
      "Intellectual Property",
      "White Collar Crimes",
      "Criminal Law",
      "Bankruptcy & Insolvency",
      "Environmental Law",
      "General Corporate",
      "Real Estate",
      "Constitutional Law",
      "Civil Litigation",
      "Debt Recovery",
      "Environmental, Social & Governance",
      "Dispute Resolution",
      "Banking & Finance",
      "Competition & Anti-trust",
      "Business Law",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "National Company Law Tribunal (NCLT)",
      "National Company Law Appellate Tribunal (NCLAT)"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/neelam-singh",
    "name": "Neelam Singh",
    "location": "Block C, New High Court Building, Vibhuti Khand, Gomti Nagar, Lucknow",
    "experience": "10 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919766453247",
    "email": "advneelams@gmail.com",
    "website": "https://www.advneelamsingh.com/",
    "linkedin": "https://www.linkedin.com/in/adv-neelam-singh-6ab10b1a0/",
    "bio": "Neelam has practiced as a criminal and matrimonial disputes lawyer in the courts of Maharashtra and Goa, Lucknow and Allahabad appearing for both the defending and actioning parties in writs, petitions, appeals, applications covering 360 degree aspects from the genesis to the conclusion of the dispute, in the Sessions Courts and the High Courts. Her acumen and experience in bail hearings involving the penal code and other statutory offences, including economic offences, lends her to process-oriented drafting and representation in such matters, among others.\nFor family disputes, she is able to use her strategic consultation to navigate pre-judicial resolution. coming in as confidant at that necessary stage, while also representing clients before the courts of law.\nHer services include, among others:\nCriminal Litigation: strategic guidance and legal advice tailored to the unique circumstances of each case,\nLegal Drafting: drafting petitions, complaints, applications, Legal Notices.\nBail Representation: Specializing in both anticipatory and regular bail petitions\nCourt Appearances: Serving as a proficient advocate in courtroom proceedings, whether as a defense lawyer or assisting counsel to the Public Prosecutor.",
    "practice_areas": [
      "Family Law",
      "Matrimonial Disputes",
      "Criminal Law"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/nikunj-dugar",
    "name": "Nikunj Dugar",
    "location": "Office No. 324, DownTown Mall, Lakadikapul, Hyderabad - 500 004",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi\nTamil\nTelegu"
    ],
    "phone": "919789000094",
    "email": "nikunjdugar10@gmail.com",
    "website": "https://www.pivotlegal.in/",
    "linkedin": "https://www.linkedin.com/in/nikunj-dugar-lawyer-criminallaw-entertainmentlaw-legaladvice-advocate/",
    "bio": "After having read law at School of Law, Christ University, Bengaluru, Nikunj started his law career as a junior counsel in the Chambers of Justice B Vijaysen Reddy Sir and worked extensively on various real estate, litigation and corporate matters at the High Court for the State of Telangana, City Civil Court, Hyderabad, Ranga Reddy District Court, NCLT, Hyderabad, State and District Consumer Commission, Revenue Courts, amongst others. His standout contribution in the chamber of Justice B Vijaysen Reddy Sir was in developing the chamber’s Debt Recovery Tribunal practice.\nAfter Justice B Vijaysen Reddy Sir’s elevation in the year 2020, Nikunj continued in the chamber which was then being headed by Mr Vivek Jain, Advocate. Under Mr. Jain, Nikunj started working extensively in civil litigation and real estate matters and started handling arbitrations.\nHe thereafter founded Pivot Legal (www.pivotlegal.in) his own chamber practice with focus and expertise in litigation and real estate matters especially in Commerical Arbitrations, Debt Recovery, Constitutional Laws, Consumer Laws, Intellectual Property Rights, Start-up compliances, amongst others.\nNikunj is also empanelled as a Panel Advocate for New India Assurance Company and is a Panel Advocate for the High Court for the State of Telangana's Legal Services Committee.",
    "practice_areas": [
      "Arbitration Law",
      "Family Law",
      "Employment & Labour Laws",
      "Matrimonial Disputes",
      "Mediation & Conciliation",
      "General Corporate",
      "Real Estate",
      "Dispute Resolution",
      "Infrastructure & Projects",
      "Banking & Finance"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/nishanth-nandagopal",
    "name": "Nishanth Nandagopal",
    "location": "Bangalore",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi\nKannada"
    ],
    "phone": "919886561586",
    "email": "nishanth@mayalaw.in",
    "website": "https://mayalaw.in/",
    "linkedin": "https://www.linkedin.com/in/nishanth-nandagopal/",
    "bio": "Nishanth Nandagopal is an accomplished attorney specialising in litigation and dispute resolution. Having worked at several prominent law firms, he has established a reputation for being a skilled strategist and persuasive advocate. Nishanth’s vast experience has allowed him to successfully handle complex disputes for individuals and organisations across various sectors. He is highly regarded for his exceptional service, rigorous analysis, and strong communication skills. Nishanth’s ability to negotiate and litigate effectively on behalf of his clients has earned him a reputation as a top-tier attorney. Nishanth is committed to providing his clients with top-notch legal representation and achieving the best possible outcomes for them.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Family Law",
      "Employment & Labour Laws",
      "Intellectual Property",
      "Criminal Law",
      "Real Estate",
      "Civil Litigation",
      "Dispute Resolution",
      "Banking & Finance",
      "Competition & Anti-trust",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/pallavi-parmar",
    "name": "Pallavi Parmar",
    "location": "H-21b, Jangpura Extension, New Delhi-110014",
    "experience": "23 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "918178195605",
    "email": "info@lexconfianceindia.com",
    "website": "https://www.lexconfianceindia.com/",
    "linkedin": "https://www.linkedin.com/company/lex-confiance-india/?viewAsMember=true",
    "bio": "Adv. Pallavi Parmar is the Founding Partner at Lex Confiance India LLP, where she along with her professional team of Advocates, having more than two decades of experience in the legal domain, provides legal services and advice to startups & MSMEs and shine as niche and trusted law offices in New Delhi. A dedicated and accomplished attorney recognized for exceptional expertise in Civil, Corporate, Constitutional, Insolvency and Tech laws.\n\nWith a proven track of successful client representation and in depth understanding of intricate legal matters, she is committed to provide strategic, transparent and cost-effective solutions for her clients. Her passion for upholding justice, paired with extensive knowledge across multiple legal domains, positions her as a reliable and sought after legal professional. In depth understanding of constitutional principles and rights as well as the private rights, enabling effective advocacy on matters related to constitutional interpretation, civil liberties, human rights and governmental powers are her core strengths in Constitutional law. She is committed to upholding the rule of law and protecting individual freedoms.\n\nShe had been adept in providing services in investment laws, privacy laws, and compliance as per Indian laws and GDPR (General Data Protection Regulation) law, cyber laws & e-commerce laws, Intellectual Property laws, labeling laws, domain name disputes, contracts drafting and negotiation, labor laws, corporate laws, and compliance, etc. In-depth understanding of intellectual property rights, including patents trademarks, copyrights and trade secrets. Assists clients in protecting, enforcing and managing their intellectual property assets including IPR licensing and assignment matters. Her practice focuses on IPR management followed by Special Leave Petitions (Civil and Criminal), transfer Petitions before the Supreme Court, NCLAT, NCLT, NCDRC, and Delhi High Court representing clients in original, Writ, commercial and appellate jurisdiction. Proven track record in Professional legal Management, Media and Technology Laws, Policy Advisory, Regulatory and Compliance Framework in India. Her preferred sectors include the blend of law into education, medical, hospitality & sports. She is also part of ICC under POSH for various Companies as an External Member and firm believer in gender neutral rights under the POSH but protecting the women rights at the same time.",
    "practice_areas": [
      "Arbitration Law",
      "Family Law",
      "Intellectual Property",
      "White Collar Crimes",
      "Bankruptcy & Insolvency",
      "Media & Entertainment",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Constitutional Law",
      "Civil Litigation",
      "Cyber Law",
      "Dispute Resolution",
      "Corporate Secretarial",
      "Banking & Finance",
      "Business Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/pavandeep-singh",
    "name": "Pavandeep Singh",
    "location": "Regus Business Center, 4th Floor, naga chamber Ramnagar Visakhapatnam- 530003",
    "experience": "15 years of experience.",
    "languages": [
      "English\nHindi\nPunjabi\nTelegu"
    ],
    "phone": "917793909623",
    "email": "Kalsipawan83@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/pavandeep-singh-90a66469",
    "bio": "Expertise in litigation areas and with a good legal advice by understanding the problem and perfect guidance in a legal manner to solve the same..",
    "practice_areas": [
      "Arbitration Law",
      "Family Law",
      "Criminal Law",
      "Contracts",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Debt Recovery",
      "Due Diligence",
      "Business Law",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/praful-abhiman-patil",
    "name": "Praful Abhiman Patil",
    "location": "Shop no. 13, Shree Satyanarayan Society, Opposite Chembur Nagrik Sahakari Bank, VN Purav Marg, Sion-Chunabhatti, Mumbai-22",
    "experience": "3 years of experience.",
    "languages": [
      "English\nHindi\nMarathi"
    ],
    "phone": "917715003577",
    "email": "advprafulpatil@gmail.com",
    "website": "https://merakilegal.in/",
    "linkedin": "https://www.linkedin.com/in/adv-praful-patil-50a035181?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
    "bio": "Adv. Praful Patil is an advocate and legal consultant based in Mumbai who specialises in Criminal Law and has strong understanding of litigation strategies. His other practice area includes Family Law, Land Disputes, Commercial and Civil Litigation, etc.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Motor Accidents",
      "Matrimonial Disputes",
      "White Collar Crimes",
      "Criminal Law",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Real Estate",
      "Property Law",
      "Human Rights Law",
      "Constitutional Law",
      "Civil Litigation",
      "Corporate Secretarial",
      "Conveyance",
      "Mining Law",
      "Negotiation",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Bombay High Court",
      "National Company Law Appellate Tribunal (NCLAT)",
      "Debts Recovery Appellate Tribunal (DRAT)",
      "Thane Sessions and District Court",
      "Bandra Family Court",
      "City Civil & Sessions Court, Bombay"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/pragalbh-sharma",
    "name": "Pragalbh Sharma",
    "location": "1057, Phase II, Swarnabhoomi, Raipur, Chattisgarh- 492007",
    "experience": "9 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919009665085",
    "email": "sharma.pragalbh@gmail.com",
    "website": "https://www.pranshlaw.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/pragalbh-sharma&title=Pragalbh%20Sharma&summary=Pragalbh%20Sharma&source=Pragalbh%20Sharma",
    "bio": "Pragalbh Sharma is actively practising as a Lawyer in various Courts, Tribunals, and Fora in the State of Chhattisgarh. After graduating from DES Law College, Pune, he started his career as a Territory Legal Manager with the Mahindra Financial Services Limited and also worked with other NBFCs and earned various accolades. However, since he always intended to set up his own practise, he gave up his job and got enrolled at the Bar in the year 2014. Sine then, he has been involved in several high-stake Criminal and Tax litigations. Within a short span of time, he has excelled in the practice of Criminal Law under the aegis and guidance of his Father, who has 33 years of experience being a Public Prosecutor in the State of Chhattisgarh. Pragalbh is a Standing Counsel for the Chhattisgarh Lok-Ayukt. He has been devotedly taking care of all the Criminal Trials of the Firm.",
    "practice_areas": [
      "Criminal Law",
      "Taxation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/prakhar-gupta",
    "name": "Prakhar Gupta",
    "location": "291 Rajeev Gandhi Nagar",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "7976413230",
    "email": "prakhar@advocateprakhar.com",
    "website": "https://armslengthlegal.com/",
    "linkedin": "https://www.linkedin.com/in/prakhar291/",
    "bio": "Welcome to Arms Length Legal, where our goal is to provide top-notch legal services to our clients in Kota, Rajasthan. We have been in the business for a number of years and have a team of dedicated and experienced professionals who work tirelessly to ensure your legal needs are met. Our services include a wide range of categories, from corporate law to family law, to meet all your legal requirements. With a team of skilled employees, we guarantee efficient and effective results. Our working hours are flexible to accommodate your busy schedule. Come visit us at Arms Length Legal and let us help you with all your legal matters.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Employment & Labour Laws",
      "Company Registration",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "White Collar Crimes",
      "Criminal Law",
      "Taxation",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Mediation & Conciliation",
      "Start-up Advisory & Compliance",
      "Mergers & Acquisitions",
      "General Corporate",
      "Human Rights Law",
      "Constitutional Law",
      "Sports & Gaming Law",
      "Civil Litigation",
      "Debt Recovery",
      "Environmental, Social & Governance",
      "Private Client Practice",
      "Cyber Law",
      "Data Privacy & Protection",
      "Capital Markets",
      "Dispute Resolution",
      "Banking & Finance",
      "Due Diligence",
      "Competition & Anti-trust",
      "Business Law",
      "Service Law",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/prashant-bhatnagar",
    "name": "Prashant Bhatnagar",
    "location": "A- 109, LGF, Defence Colony, Delhi - 110024",
    "experience": "10 years of experience.",
    "languages": [
      "English\nHindi\nPunjabi"
    ],
    "phone": "9582272888",
    "email": "easemycase@gmail.com",
    "website": "https://www.easemycase.com/",
    "linkedin": "https://www.linkedin.com/company/easemycase/",
    "bio": "Prashant Bhatnagar, the founder of easemycase, brings with him multiple years of experience in the legal field. Having worked with several prominent law firms and chambers in both India and London, he has developed a deep understanding of the complexities clients face when navigating legal processes.\nRecognizing the need for more accessible and client-friendly legal services, Prashant established easemycase, an innovative platform that simplifies the legal journey for individuals and businesses. Easemycase has pan India connections, offering affordable, high-quality legal services. The platform also manages cases on behalf of clients and provides tailored updates, ensuring a seamless and transparent legal experience.\nPrashant's vision is to revolutionize the delivery of legal services by making them more efficient, transparent, and accessible to all.",
    "practice_areas": [
      "Arbitration Law",
      "Aviation Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Intellectual Property",
      "POSH Advisory",
      "Matrimonial Disputes",
      "Divorce",
      "Criminal Law",
      "Contracts",
      "Mediation & Conciliation",
      "Immigration & Customs Law",
      "Real Estate",
      "Civil Litigation",
      "Debt Recovery",
      "Dispute Resolution",
      "Due Diligence",
      "Conveyance",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "Bombay High Court",
      "Tis Hazari Court",
      "Madras High Court",
      "Allahabad High Court",
      "Patiala House Court",
      "National Company Law Tribunal (NCLT)",
      "Ghaziabad District & Session Court",
      "National Green Tribunal (NGT)",
      "Punjab & Haryana High Court",
      "Saket Court",
      "Debts Recovery Appellate Tribunal (DRAT)",
      "Debts Recovery Tribunal, Delhi",
      "National Consumer Disputes Redressal Commission",
      "District & Sessions Court, Gurugram",
      "Real Estate Regulatory Authortity (RERA), Punjab",
      "Real Estate Regulatory Authortity (RERA), Delhi",
      "Real Estate Regulatory Authortity (RERA), Kerala",
      "State Consumer Disputes Redressal Commission, Punjab",
      "State Consumer Disputes Redressal Commission, Haryana",
      "Surajpur Greater Noida Court",
      "Rohini District Court",
      "District And Sessions Court, Chandigarh",
      "District and Sessions Court Jaipur"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/prem-kumar-r-pandey",
    "name": "Prem Kumar R. Pandey",
    "location": "SP-8, 2nd Floor, SP Business Center, Prakash Chamber, 77, Nagindas Master Road, Fort, Mumbai-400001, Maharashtra, India.",
    "experience": "18 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919324248000",
    "email": "92ppandey@gmail.com",
    "website": "https://advocateprem.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/prem-kumar-r-pandey&title=Prem%20Kumar%20R.%20Pandey&summary=Prem%20Kumar%20R.%20Pandey&source=Prem%20Kumar%20R.%20Pandey",
    "bio": "He is enrolled as an Advocate with Bar Council of Maharashtra & Goa and in his initial days he was associated with reputed namely S.K. Legal & Associates, (Advocates & Solicitor) & Dinesh Tiwari & Associates. While working with the said Law firms he has got very good exposure of civil as well as criminal matters. Before practicing as an advocate, he had worked with reputed corporates like Axis Bank & Reliance Communication. He is currently practicing in Bombay High Court and other civil and criminal courts across Mumbai, Maharashtra, New Delhi, Madhya Pradesh and majorly practices Criminal Law. He is specialised in Regular Bail and Anticipatory Bail matters, quashing of FIR & charge sheet, Discharge application, Cheque Bouncing matters. Besides this he has also handled various civil matters related to Maharashtra Rent Control Act, Co-operative Society Act, Labour Law, Arbitration Act, Company Law, Insolvency and Bankruptcy matters. He has appeared & argued before various courts, viz. Hon’ble Supreme Court of India, Hon’ble Bombay High Court & Gujarat High Court, Madhya Pradesh High Court, Ahmedabad Session Court, Magistrate Court in Kolkata, City Civil & session courts at Bombay, Dindoshi, Pune & Raigad, Co-operative Courts, Small Causes Court, and Competent Authorities, tribunals and Arbitrator. Further he liaison with government as well semi government bodies, Police whenever required.",
    "practice_areas": [
      "Arbitration Law",
      "Criminal Law",
      "Mediation & Conciliation",
      "General Corporate",
      "Property Law",
      "Civil Litigation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/pridhi-singla",
    "name": "Pridhi Singla",
    "location": "1018, Sector 15- B, Chandigarh- 160015",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi\nPunjabi"
    ],
    "phone": "919914910880",
    "email": "advsinglapridhi@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/pridhi-singla&title=Pridhi%20Singla&summary=Pridhi%20Singla&source=Pridhi%20Singla",
    "bio": "An experienced Corporate law and Intellectual Property law advisor to manufacturing companies, start ups, resolution professionals, Committee of Creditors and liquidators. She practices primarily in NCLT & High Court of Punjab & Haryana. She is a graduate from Panjab University and completed her Masters in Corporate and Financial Laws from OP Jindal University.\nWith a sound grounding in corporate debt restructuring, Mergers & Acquisitions, voluntary liquidation, initiation of CIRP, winding up and corporate governance proceedings under Company Law, supplemented by experience in compliances for corporates across at least a dozen sectors over the last 5 years, She is an independent legal advisor to corporates in the Punjab region as well as other parts of India.\nHer insolvency law advice extends to drafting and submission of insolvency petitions, advising RPs on tricky claim admissions, Insolvency matters, company law matters, all aspects of running the corporate insolvency resolution process, leading the Committee of Creditors (COC) meetings and providing legal advise/responses to any kind of queries posed by lenders on real time basis in large COC meetings, advising on all aspects of Insolvency and Bankruptcy Code and Regulations thereunder.\nHer litigation advisory and representation practice includes devising strategies with resource-optimised outcomes, Drafting/ review and filing of Misc Applications, Petitions, Appeals, Affidavits, Replies, Rejoinders before NCLT, NCLAT, High Court, DRT, Consumer Courts, Supreme Court and preparing Counters and legal research on relevant cases.\nShe also advises on compliances for companies across sectors such as manufacturing (textiles, metals, auto), pharma and healthcare, insurance, banks and NBFCs, construction, energy, real estate, e-commerce among others. Negotiating and drafting commercial agreements relating to, inter-alia, Mergers/ Acquisition are also within her scope.\nShe regularly appears in forums such as NCLT/NCLAT, MSME, DRT, RERA and Consumer Court in addition to the High Court.\nThe volume and versatility of legal work that she has executed has lended itself to timelines that are against the clock. she believes in weaving in quality checks consistently, through fast paced dispute resolution, advisory and compliance.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Intellectual Property",
      "Bankruptcy & Insolvency",
      "Start-up Advisory & Compliance",
      "Mergers & Acquisitions",
      "General Corporate",
      "Debt Recovery",
      "Dispute Resolution",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [
      "National Company Law Tribunal (NCLT)",
      "Punjab & Haryana High Court",
      "National Company Law Appellate Tribunal (NCLAT)",
      "Debts Recovery Tribunal, Chandigarh",
      "State Consumer Disputes Redressal Commission, Punjab"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/priyanshi-bhardwaj",
    "name": "Priyanshi Bhardwaj",
    "location": "Delhi",
    "experience": "1 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "917982301113",
    "email": "advbhardwajpriyanshi@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/adv-priyanshi-bhardwaj-424149176",
    "bio": "I am Priyanshi Bhardwaj, a dedicated and passionate legal enthusiast. As I embark on my journey in the legal profession, I am driven by a sincere commitment to uphold justice and serve the community.\nI practice in all district courts of Delhi NCR and the High Court of Delhi. My reach extends throughout the region, making legal assistance readily accessible.\nWhen you choose to work with me, you're not just hiring a lawyer; you're partnering with an advocate committed to securing the best outcome for you. I combine my sharp legal acumen with a profound dedication to every case, ensuring that justice prevails.\nFor expert legal consultancy and unwavering support in your legal journey, look no further. Reach out to me, Adv. Priyanshi Bhardwaj, and let's work together to achieve the justice you deserve.\nYou can find me at Saket District Court, Chamber No. 324, Lawyer's Block, where I am eager to assist you with your legal questions and concerns.",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Intellectual Property",
      "POSH Advisory",
      "Divorce",
      "White Collar Crimes",
      "Criminal Law",
      "Contracts",
      "Mediation & Conciliation",
      "Environmental Law",
      "Real Estate",
      "Human Rights Law",
      "Constitutional Law",
      "Civil Litigation",
      "Dispute Resolution",
      "Banking & Finance"
    ],
    "forums_of_practice": [
      "High Court of Delhi",
      "Tis Hazari Court",
      "Saket Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/radhika-bishwajit-dubey",
    "name": "Radhika Bishwajit Dubey",
    "location": "C-9, Basement, Defence Colony, New Delhi- 110024",
    "experience": "16 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919810982927",
    "email": "radhika.arora21@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/radhika-bishwajit-dubey-ba249b20/",
    "bio": "Radhika Bishwajit Dubey has about 16 years of experience in dispute resolution with special focus on alternative dispute resolution mechanisms including arbitration and mediation. Radhika regularly represents clients before various fora including the Supreme Court, High Courts and Tribunals in high stake commercial matters. She is also a Senior Panel Counsel for Union of India and Additional Standing Counsel for MCD. After completing her law graduation, she enrolled with the Bar Council of Delhi in 2007 and joined Hon’ble Mr. Justice Sanjay Kishan Kaul as his judicial clerk. Thereafter, she worked in Dubai with Horizon and Co. In 2010, she joined Amarchand Mangaldas Suresh A. Shroff and Co. In 2015, she joined Cyril Amarchand Mangaldas and was subsequently promoted to partnership. She has taken to independent practice recently.\nApart from her Counsel practice, she has also been appointed as an Arbitrator in a host of matters. She is empaneled as an arbitrator with the Delhi International Arbitration Centre as well. She is a trained mediator with the Mediation and Conciliation Project Committee, and also empaneled with the Supreme Court Mediation Centre. She has many of her pieces published in various journals.\nShe regularly gets invited as a speaker to various events to deliver lectures on arbitration and other legal issues. Supreme Court Cases (SCCOnline) has also collaborated with her to spearhead the initiative on mental health and the legal fraternity.",
    "practice_areas": [
      "Arbitration Law",
      "Mediation & Conciliation",
      "General Corporate",
      "Civil Litigation",
      "Dispute Resolution",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/raghumanyu-taneja",
    "name": "Raghumanyu Taneja",
    "location": "P-93, Lower Ground Floor, CR Park, New Delhi-110019",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi\nPunjabi"
    ],
    "phone": "9599196420",
    "email": "tanejaraghu@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/raghumanyu-taneja-412341b2/",
    "bio": "Raghumanyu is a first-generation lawyer. He has a mixed PQE of more than 4 years in the field of law, policy, and politics. After completing 20 internships in law school including a semester exchange via AIESEC to Cairo, Egypt, he joined the Chambers of Mr. Jai A Dehadrai, Standing Counsel for the Union of India at the Hon'ble Supreme Court as a litigation counsel.\n\nAfter completing a little less than 2 years, he wanted to professionally assist politicians and market their campaigns and joined I-PAC as a core team member of the Political Intelligence Unit. He was a part of the campaign team that led the TMC flag for the Goa assembly elections in 2021.\n\nHe then decided to work as a public policy consultant with a notable think tank, 'Bridge' in Delhi. As the MCD elections in Delhi were around the corner, he left his job and decided to assist Mr. Kunwar Arjun Singh Pal Marwah with the upcoming elections which unfortunately got postponed. After the MCD elections were notified to be held in December 2022, he decided to manage Mr. Marwah's campaign and led him to victory from the Lajpat Nagar ward (Ward-144) making Mr. Marwah the youngest BJP Councilor.\n\nAt present, he is pursuing counsel practice after having worked with Human Elevation as a full time consultant after completing a judicial clerkship with Hon’ble Mr. Justice Saurabh Banerjee at the Hon'ble High Court of Delhi.\n\nHe has been the lead anchor for the Indian Red Cross Society whereby he went to different schools and colleges and taught the youth the ill effects of drug abuse. He is a core team member of Sarvahitey, NGO where he has actively steered Project Paper Bridge (an ambitious project of opening 1000 libraries across the remotest parts of India) (https://www.sarvahitey.org/paper-bridge).\n\nHe is also an accredited Mediation Counsel from the Standing Conference of Mediation Advocates, SCMA, London, UK, and truly believes that with the new mediation bill, the landscape of mediation in India will change for good.",
    "practice_areas": [
      "Arbitration Law",
      "White Collar Crimes",
      "Criminal Law"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ragini-singh",
    "name": "Ragini Singh",
    "location": "1208, A-Wing, Dalamal Tower, Free Press Marg, Nariman Point, Mumbai-12",
    "experience": "12 years of experience.",
    "languages": [
      "English\nHindi\nPunjabi"
    ],
    "phone": "919699182277",
    "email": "contactus@rs-assoc.com",
    "website": "https://www.rs-assoc.com/",
    "linkedin": "https://in.linkedin.com/in/ragini-singh-62533610a",
    "bio": "Ragini is an advocate and founder of the law firm, Ragini Singh and Associates (RSA), based primarily in Mumbai (Nariman Point) and Delhi, with clients in England. She is also a qualified Solicitor in England and Wales.\nShe is an alumnus of Government Law College, Mumbai and University College London, England from where she completed her LLM in International Finance.\nShe is also an Advisory Member of the Central Board of Film Certification of India, popularly and rather unfairly known as the “Censor Board”.\nThe firm, RSA, acts as legal advisors to the Bombay Stock Exchange, amongst others. While RSA primarily deals with Corporate, Securities and Commercial Dispute Resolution, it offers a full range of legal services across practice areas that include White Collar Crime, Income Tax Litigation, Service Law and Real Estate.",
    "practice_areas": [
      "Arbitration Law",
      "White Collar Crimes",
      "General Corporate",
      "Regulatory & Securities",
      "Business Law"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/rajashree-raghavan",
    "name": "Rajashree Raghavan",
    "location": "336 (166) Thambu Chetty Street, Third Floor, Chennai 600 001",
    "experience": "27 years of experience.",
    "languages": [
      "English\nHindi\nMalyalam\nTamil"
    ],
    "phone": "919841169016",
    "email": "rajashreepradeep2014@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/rajashree-raghavan&title=Rajashree%20Raghavan&summary=Rajashree%20Raghavan&source=Rajashree%20Raghavan",
    "bio": "Specialized in civil laws, contracts, documentation & conveyance, property laws, service law, and family law. Conducted legal research, drafted contracts and agreements, and provided expert advice to clients.Successfully represented clients in negotiations, mediations, and court proceedings",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Employment & Labour Laws",
      "Matrimonial Disputes",
      "Divorce",
      "Contracts",
      "Insurance Law",
      "Mediation & Conciliation",
      "Property Law",
      "Constitutional Law",
      "Civil Litigation",
      "Debt Recovery",
      "Banking & Finance",
      "Conveyance",
      "Service Law",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [
      "Madras High Court",
      "Debts Recovery Appellate Tribunal (DRAT)",
      "Debts Recovery Tribunal, Chennai"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ramakrishnan-viraraghavan",
    "name": "Ramakrishnan Viraraghavan",
    "location": "No. 21, New Lawyers Chambers, Supreme Court, New Delhi - 110001",
    "experience": "37 years of experience.",
    "languages": [
      "English"
    ],
    "phone": "9717799295",
    "email": "communications@rkvchambers.com",
    "website": "https://www.rkvchambers.com/",
    "linkedin": "https://www.linkedin.com/in/ramakrishnan-viraraghavan-9b6ba994/",
    "bio": "Ramakrishnan Viraraghavan (RKV) is a dual-qualified lawyer with 37 years of practice. He is a renowned Supreme Court litigator. He is also a Barrister in the UK and practices both in India and UK. He is also an arbitrator in international commercial arbitrations.\nViraraghavan has been time and again counted amongst the best Insolvency & Bankruptcy Lawyers in India and has successfully appeared in several precedent-setting matters. He regularly appears before the Supreme Court, National Company Law Tribunal, and National Company Law Appellate Tribunal, prosecuting and defending cases under the Insolvency and Bankruptcy Code for petitioning creditors, corporate debtors, resolution applicants, and resolution professionals as an insolvency litigation lawyer.\nHe has an outstanding track record of practice in tax litigation, constitutional law, and civil and criminal matters. He has recently authored a commentary on GST Laws in India.\nRKV is a resource person at the National Judicial Academy, Bhopal, and frequently participates in orientation courses and all-India conferences for High Court judges and district judges.\nRKV has been recognized as the best tax dispute lawyer. Therefore, under auspices of the National Judicial Academy, he has been invited to lecture the Customer Excise and Service Tax Appellate Tribunal (CESTAT) field officers and the Central Bureau of Indirect Taxes and Customs (CBIC).\nIn addition to practicing in taxation and commercial laws RKV also practices in general and procedural laws, including the Transfer of Property Act, Civil Procedure Code, Criminal Procedure Code, Court Fees Act, Hindu Laws, Indian Succession Act, and Stamp Act. He handles matters in general law such as matters in the Supreme Court relating to partition, declarations, specific performance, rent control proceedings, criminal cases, quashing and bail.",
    "practice_areas": [
      "Arbitration Law",
      "Criminal Law",
      "Taxation",
      "Bankruptcy & Insolvency",
      "Civil Litigation",
      "Dispute Resolution",
      "Banking & Finance",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "National Company Law Tribunal (NCLT)",
      "National Company Law Appellate Tribunal (NCLAT)"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ranjana-thakur",
    "name": "Ranjana Thakur",
    "location": "Village Chewa, PO Kumarhatti, Tehsil and District Solan",
    "experience": "2 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "918894498273",
    "email": "advocateranjana001@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/ranjanathakuradvocatechandigarh?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app",
    "bio": "Ms. Ranjana Thakur has more than 2 years of experience in litigation circling around the realms of criminal, civil, family law, dispute resolution and arbitration as well as property and NIA cheque bounce matters.\nShe has advised several clients on judicial and quasi-judicial matters such as the DRT, RERA, Consumer forums, CAT & such other forums of tricity.\nShe has advocated protection & bail matters at the Hon’ble Punjab & Haryana High Court, settled consumer disputes, and handled family conflicts at district courts of tricity.\nAdditionally, she freelances in contract drafting, having successfully associated & crafted MoUs for a Himachal-based entertainment company.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Family Law",
      "Employment & Labour Laws",
      "Matrimonial Disputes",
      "Divorce",
      "Criminal Law",
      "Contracts",
      "Civil Litigation",
      "Dispute Resolution"
    ],
    "forums_of_practice": [
      "Punjab & Haryana High Court",
      "Himachal Pradesh High Court",
      "Debts Recovery Tribunal, Chandigarh",
      "Real Estate Regulatory Authortity (RERA), Punjab",
      "State Consumer Disputes Redressal Commission, Punjab",
      "State Consumer Disputes Redressal Commission, Haryana"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ravi-singh-chhikara",
    "name": "Ravi Singh Chhikara",
    "location": "E-175, LGF, Kailash Colony - I, New Delhi - 110048",
    "experience": "2 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "917042131601",
    "email": "adv.ravisinghchhikara@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/ravi-singh-chhikara&title=Ravi%20Singh%20Chhikara&summary=Ravi%20Singh%20Chhikara&source=Ravi%20Singh%20Chhikara",
    "bio": "Leading lawyer in Delhi.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Family Law",
      "Motor Accidents",
      "Employment & Labour Laws",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "White Collar Crimes",
      "Criminal Law",
      "Taxation",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Environmental Law",
      "General Corporate",
      "Property Law",
      "Constitutional Law",
      "Civil Litigation",
      "Debt Recovery",
      "Cyber Law",
      "Data Privacy & Protection",
      "Dispute Resolution",
      "Infrastructure & Projects",
      "Succession & Estate Planning",
      "Service Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "Tis Hazari Court",
      "Patiala House Court",
      "Dwarka Court",
      "Rouse Avenue Court",
      "National Company Law Tribunal (NCLT)",
      "Ghaziabad District & Session Court",
      "National Green Tribunal (NGT)",
      "Punjab & Haryana High Court",
      "Saket Court",
      "National Company Law Appellate Tribunal (NCLAT)",
      "National Consumer Disputes Redressal Commission",
      "District & Sessions Court, Gurugram"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/rishabh-garg",
    "name": "Rishabh Garg",
    "location": "1057, Phase II, Swarnabhoomi, Raipur, Chattisgarh- 492007",
    "experience": "12 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "918827815000",
    "email": "rgarg@pranshlaw.com",
    "website": "https://www.pranshlaw.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/rishabh-garg&title=Rishabh%20Garg&summary=Rishabh%20Garg&source=Rishabh%20Garg",
    "bio": "Rishabh is an alumnus of ILS Law College, Pune and National University of Singapore. He is a Founding Partner at Pransh Law Offices and heads the office at Raipur, Chhattisgarh. He has previously worked with the Global Litigation and Arbitration Team of Tech Mahindra Limited, Hyderabad, where he worked on a myriad of Employment Cases, Arbitrations, Contracts, and Cross-Border Mergers & Acquisitions.\nRishabh regularly appears in high value commercial disputes before various domestic fora. He is one of the few attorneys who have been advising clients and appearing in disputes relating to DDUGKY across India. He also regularly advises clients in the Mining, Construction, and Infrastructure Industry.",
    "practice_areas": [
      "Arbitration Law",
      "White Collar Crimes",
      "Contracts",
      "Mergers & Acquisitions",
      "Dispute Resolution"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ritesh-chandra",
    "name": "Ritesh Chandra",
    "location": "302, Third Floor, Link Plaza, Opposite Infinity Mall, Andheri West, Mumbai 400053",
    "experience": "25 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "9152504123",
    "email": "ritesh@vidhikritlegal.com",
    "website": "https://vidhikritlegal.com/",
    "linkedin": "https://www.linkedin.com/in/riteshchandra/",
    "bio": "Ritesh Chandra is an accomplished lawyer with a distinguished career spanning around 25 years, during which he has acquired extensive and diverse range of legal expertise. He has navigated the intricacies of the legal landscape in 25 countries across 6 continents and almost 12 industries, including automobile, aviation, beverages,  chemicals, e-commerce, FMCG, fresh food, IT, manufacturing, Oil and gas, power, retail and telecom.\nWhile working for some renowned names like Tata Power Delhi Distribution Ltd., Airtel, Tata Motors, Brambles Ltd. Ritesh has played a pivotal role in leading high-value multimillion-dollar transactions, M&A deals, litigations and arbitrations on a global scale. He has also been a Director on the Board of Directors of Companies in India, Japan, Malaysia, Taiwan and Thailand.\nHis proficiency lies in the areas of Start up Advisory, Structuring and incorporation of entities, Acquisitions Mergers and demergers, Infrastructure and projects, Banking and financial laws, Joint ventures, Corporate and Board Restructuring, Board Directorships, Secretarial matters, high-value Corporate and Commercial transactions, In-Country and Global contracts, Negotiations, Risk Assessment and Management, Inbound and Outbound Investments, Litigations and Arbitrations, Corporate and Statutory Compliances, Government and Regulatory affairs.\nWith his substantial multi-jurisdictional work experience and distinguished network of associates, Ritesh can help clients in foreign jurisdictions like, Australia, Botswana, Canada, China, Chile, France, Germany, Hong Kong, Japan, Malaysia, Mozambique, Namibia, New Zealand, Portugal, Qatar, Saudi Arabia, Spain, Singapore, Swaziland, South Africa, Thailand, Turkey, Taiwan, UK, UAE, USA, Zimbabwe and Zambia to name a few.\nRitesh has consistently delivered outstanding results, securing favorable outcomes for the businesses he has worked with. Ritesh combines his meticulous attention to detail with his practical approach, ensuring that he remains a trusted advisor for clients seeking legal counsel.",
    "practice_areas": [
      "White Collar Crimes",
      "Bankruptcy & Insolvency",
      "Mediation & Conciliation",
      "Start-up Advisory & Compliance",
      "Mergers & Acquisitions",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Debt Recovery",
      "Environmental, Social & Governance",
      "Telecom Law",
      "Private Client Practice",
      "Cyber Law",
      "Data Privacy & Protection",
      "Regulatory & Securities",
      "Private Equity & Venture Capital",
      "Dispute Resolution",
      "Infrastructure & Projects",
      "Project Finance",
      "Restructuring",
      "Banking & Finance"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/robin-vincent",
    "name": "Robin Vincent",
    "location": "2nd Floor, Universal Tower, Kurji, Sadaquat Ashram, Patna, Bihar 800010",
    "experience": "3 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "91912341321",
    "email": "iptrademarkclinic@gmail.com",
    "website": "https://www.iptrademarkclinic.com/",
    "linkedin": "https://www.linkedin.com/in/robin-vincent-98a055189",
    "bio": "Robin Vincent is currently practicing as an Advocate and Intellectual Property Attorney based at Patna, Bihar . He completed his B.A.LL.B (Intellectual Property Law Hons.) from Central University of South Bihar and is a Gold Medalist. Further he completed his Post Graduate Diploma in Intellectual Property Rights from Indian Law Institute, Delhi.\nHe has previously been associated with RNA Technology and IP Attorneys as a Trainee Associate. He has also worked as an Associate at Corporate Legal Partners, New Delhi. Currently he is practicing as an Advocate at Patna High Court and as an IP Attorney before the various registries.\nHe was a participant of the WIPO-INDIA Summer School 2019 conducted by WIPO, MNLU and RGNIIPM at Nagpur. He has done various certificate programs from World Intellectual Property Organization, Geneva, Indian Law Institute, New Delhi and Indian Institute of Patent and Trademark., New Delhi.",
    "practice_areas": [
      "Company Registration",
      "Intellectual Property",
      "Taxation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/rodney-d-ryder",
    "name": "Rodney D. Ryder",
    "location": "Level 2, Elegance, Mathura Road, Jasola, New Delhi – 110025, India",
    "experience": "27 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919811013560",
    "email": "rodney@scriboard.com",
    "website": "https://www.scriboard.com/",
    "linkedin": "https://www.linkedin.com/in/rodneydryder/",
    "bio": "Rodney D. Ryder is a leading technology, intellectual property and corporate lawyer. Rodney Ryder is Senior Partner, Intellectual Property, Technology, and IT at The Chambers®: Advocates & Legal Consultants. He is also the founding partner at Scriboard®; He is the author of Guide to Cyber Laws: the Information Technology Act, 2000, E-Commerce, Data Protection and the Internet, the first section-wise analysis of the Indian Information Technology Act, 2000. He is presently Advisor to the Ministry of Communications and Information Technology, Government of India on the implementation of the Information Technology Act, 2000. Mr. Ryder has been nominated as a ‘Leading Lawyer’ in intellectual property, technology, communications and media law by Asia Law, Who’sWhoLegal, Asia Legal 500, amongst other International publications. Mr. Ryder is also advisor to the Data Security Council of India [a NASSCOM initiative] on the structuring of industry data privacy and information security policies and contractual standards. His second book, Intellectual Property and the Internet, published by LexisNexis is perhaps the only one of its kind in Asia. The text has been acknowledged to be an authoritative work by the Hon’ble Supreme Court of India and has been quoted in the first and only judgement by the Hon’ble Supreme Court of India on domain names. He is advisor to the National Internet Exchange of India [NiXI] and a member of the panel of independent and neutral arbitrators with NiXI.",
    "practice_areas": [
      "Intellectual Property",
      "Contracts",
      "General Corporate",
      "Cyber Law",
      "Data Privacy & Protection",
      "Artificial Intelligence"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/rounak-sinha",
    "name": "Rounak Sinha",
    "location": "Mahendrapuram Apartment, Block A, House No.N4, Polsan Digha Road, Patna, Bihar - 800011",
    "experience": "3 years of experience.",
    "languages": [
      "Bhojpuri\nEnglish\nHindi"
    ],
    "phone": "919113342838",
    "email": "rounak.law@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/rounak-sinha&title=Rounak%20Sinha&summary=Rounak%20Sinha&source=Rounak%20Sinha",
    "bio": "Advocate Rounak Sinha is a promising legal talent who has completed his B.A.LL.B(Hons.)(Crime & Criminology) with CGPA 9.25 and First Class with Distinction, securing the 1st rank in his batch. His academic excellence is matched by his proactive approach to legal advocacy and social justice.\nIn 2022, Mr. Sinha made a significant impact by seeking a ban on gutkha and tobacco products in the State of Bihar. He filed a Public Interest Litigation before the Hon'ble High Court of Judicature at Patna, which resulted in a one-year ban on gutkha in the state, showcasing his commitment to public health and welfare.\nMr. Sinha’s recent triumph in a legal case centered around the \"Restaurant Packaging Charge\" levied on platforms like Zomato, Swiggy, and Eatsure further highlights his legal acumen. This case brought him significant recognition and he was featured in notable publications such as The Hindu, Money Control, Divya Bhaskar, News9live, and Mashable India.\nMr. Sinha’s powerful way of speaking and drafting has been pivotal in many cases. Notably, in 2022, he also played an important role where the Hon'ble High Court lifted the ban on 14-wheel trucks, demonstrating his ability to handle complex legal issues and effect meaningful change.\nBeyond his courtroom successes, Rounak has undertaken several initiatives aimed at promoting social justice and public welfare. His dedication to these causes has led to invitations as a speaker at esteemed platforms, including the Bureau of Indian Standards and the Consumer Education & Research Centre, where he shares his insights and advocates for consumer rights and standards.\nRounak Sinha's blend of academic prowess, impactful legal work, and commitment to social justice positions him as a rising star in the legal field, ready to make further contributions to the profession and society.",
    "practice_areas": [
      "Consumer Law & Product Liability",
      "Family Law",
      "Intellectual Property",
      "Matrimonial Disputes",
      "Divorce",
      "White Collar Crimes",
      "Taxation",
      "Insurance Law",
      "Mediation & Conciliation",
      "Media & Entertainment",
      "Real Estate",
      "Property Law",
      "Human Rights Law",
      "Constitutional Law",
      "Civil Litigation",
      "Debt Recovery",
      "Telecom Law",
      "Data Privacy & Protection",
      "Succession & Estate Planning",
      "Mining Law",
      "Tenders & Government Procurement",
      "Business Law",
      "Service Law",
      "Legal Advisory & Consultancy"
    ],
    "forums_of_practice": [
      "Patna High Court",
      "Debts Recovery Tribunal, Patna"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/rpr-legal-nexus",
    "name": "RPR LEGAL NEXUS",
    "location": "60/3877A-3, Sacramento Building ,Luiz Lane, near Thevera market, Perumanoor, Kochi, Ernakulam, Kerala 682015",
    "experience": "years of experience.",
    "languages": [],
    "phone": "9400222945",
    "email": "rprkeralaservices@gmail.com",
    "website": "https://rprlegalnexus.in/",
    "linkedin": "https://www.linkedin.com/in/adv-raghesh-issac-p-226869b8",
    "bio": "Advocate Raghesh Issac P\nLocation: Kochi, Kerala,  (Serving clients across kerala)\nExpertise:\nApproach: My practice is founded on a commitment to tenacious advocacy and client-centric solutions. I understand the intricacies of Indian consumer and insurance law, offering clear legal advice, strategic negotiation, and assertive representation. Whether seeking compensation, redressal, or specific performance, I am dedicated to achieving the best possible outcomes for my clients.\nContact: 9400222945 \nhttps://rprlegalnexus.in",
    "practice_areas": [
      "Arbitration Law"
    ],
    "forums_of_practice": [
      "Supreme Court of India"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/saket-agarwal",
    "name": "Saket Agarwal",
    "location": "15-A, First Floor, Shankar Market, Cannaught Place, New Delhi - 110 001",
    "experience": "23 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "9810176867",
    "email": "agarwalandco@gmail.com",
    "website": "https://www.agarwalandco.com/",
    "linkedin": "https://www.linkedin.com/in/saket-agarwal",
    "bio": "Mr. Saket Agarwal is a seasoned legal professional with nearly two decades of experience in corporate and allied laws.\nA skilled and experienced litigator, Mr. Agarwal has handled a broad spectrum of matters, including writ petitions, recovery suits, specific performance actions, trademark infringement litigation, injunction matters, company petitions, and various proceedings before the High Courts, Company Law Board, and the National Company Law Tribunal (NCLT).\nHe has significant experience in advising and representing clients in the formation and negotiation of joint ventures, as well as in general commercial and corporate law matters. His expertise spans diverse areas such as corporate advisory, transactional matters, and corporate-commercial disputes before courts and arbitral tribunals.\nWidely recognized as a leading legal counsel, Mr. Agarwal regularly appears before multiple forums, including the NCLT, NCLAT, DRT, DRAT, NGT, various High Courts, and the Hon’ble Supreme Court of India. He has advised multinational corporations, government bodies, and clients across industries such as banking, information technology, real estate, infrastructure, energy, pharmaceuticals, FMCG, media, hospitality, telecommunications, and e-commerce.\nHis advisory portfolio includes esteemed organizations such as the Shipping Corporation of India Ltd., The Institute of Cost Accountants of India (ICAI), and All India Institute of Medical Sciences (AIIMS).\nMr. Agarwal has been engaged in several matters of national and public significance, representing both State Government enterprises and private entities before the Supreme Court and various High Courts.\nHe has actively contributed to matters reported in the Supreme Court Cases (SCC), including:\nAshok Kumar v. State of Uttarakhand, 2013 (1) SCC\nAmit Singh v. State of Maharashtra, (2011) 13 SCC 744\nSunita Rani & Ors. v. Shri Chand & Ors., 2009 (10) SCC 628",
    "practice_areas": [
      "Arbitration Law",
      "Consumer Law & Product Liability",
      "Company Registration",
      "Intellectual Property",
      "Divorce",
      "Criminal Law",
      "Contracts",
      "Bankruptcy & Insolvency",
      "Start-up Advisory & Compliance",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Debt Recovery",
      "Telecom Law",
      "Capital Markets",
      "Dispute Resolution",
      "Infrastructure & Projects",
      "Banking & Finance",
      "Due Diligence",
      "Business Law",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "High Court of Delhi",
      "National Company Law Tribunal (NCLT)",
      "National Green Tribunal (NGT)",
      "The Telecom Disputes Settlement and Appellate Tribunal (TDSAT)",
      "National Company Law Appellate Tribunal (NCLAT)",
      "State Consumer Disputes Redressal Commission, Delhi",
      "Real Estate Regulatory Authortity (RERA), Delhi"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/saket-bisani",
    "name": "Saket Bisani",
    "location": "No. 5/5, 3rd Floor, 4th Cross, 7th Block, Jayanagar, Bangalore- 560070",
    "experience": "8 years of experience.",
    "languages": [
      "English"
    ],
    "phone": "919964057235",
    "email": "saket@bisanilegal.com",
    "website": "https://bisanilegal.com/",
    "linkedin": "https://in.linkedin.com/in/saket-bisani-1274271b",
    "bio": "Mr. Saket Bisani, the visionary behind Bisani Legal, is a highly esteemed and accomplished lawyer in Bengaluru with a passion for delivering exceptional legal services. With a wealth of experience and a commitment to excellence, Mr.Saket Bisani has built a reputation for providing outstanding representation and guidance to clients.\nHe is a respected thought leader in the legal field, often sought after for his insights and expertise. He stays at the forefront of legal developments and continuously invests in their professional growth to provide his clients with the highest level of representation.\nMr.Saket Bisani has a strong track record of success in his field. His expertise spans across Constitution Law, Information Technology, Contract Structuring and Intellectual Property, and he brings a deep understanding of the complexities and nuances of the law to every case he handles.\nThroughout their career, Mr.Saket Bisani has demonstrated unwavering dedication to his clients’ needs. He takes the time to listen attentively, understand his clients’ goals, and develop tailored legal strategies to achieve favorable outcomes.\nBeyond their legal practice, Mr. Saket Bisani is known for his commitment to making a positive impact in the community. He actively participates in pro bono work and philanthropic endeavors, exemplifying his belief in giving back and supporting those in need.\nWith Mr. Saket Bisani at the helm, Bisani Legal embodies a strong commitment to excellence, integrity, and client satisfaction. His leadership and vision have laid the foundation for a law firm that consistently delivers exceptional legal services and makes a positive impact in the lives of their clients.",
    "practice_areas": [
      "Employment & Labour Laws",
      "Intellectual Property",
      "Matrimonial Disputes",
      "White Collar Crimes",
      "Bankruptcy & Insolvency",
      "General Corporate",
      "Constitutional Law",
      "Dispute Resolution",
      "Banking & Finance",
      "Competition & Anti-trust"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/sakshi-jaiswal",
    "name": "Sakshi Jaiswal",
    "location": "7-Jha-27, Jawahar Nagar, Jaipur, Rajasthan - 302004",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919011787799",
    "email": "info@attorneyschecklist.com",
    "website": "https://attorneyschecklist.com/",
    "linkedin": "https://www.linkedin.com/in/sakshi-jaiswal-16011995/",
    "bio": "Sakshi Jaiswal is a lawyer with over five years of experience in commercial litigation and commercial contracts across a wide spectrum of industries. She is currently working at KLME Middle East under the tutelage of esteemed lawyers from across the world.\nDuring her practice in India, Sakshi has been actively involved in a number international arbitrations involving government contracts and has assisted several clients with their media-related documents. Sakshi has also been an educator at an ed-tech company in India, where she has helped lawyers qualify for various law entrances and government exams.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "Contracts",
      "Mediation & Conciliation",
      "Civil Litigation",
      "Dispute Resolution"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/sandeep-chilana",
    "name": "Sandeep Chilana",
    "location": "C-56, LGF, Jangpura, Block C, Jungpura Extension, New Delhi, Delhi 110014",
    "experience": "15 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919910084446",
    "email": "sandeep.chilana@cclaw.in",
    "website": "https://www.cclaw.in/",
    "linkedin": "https://in.linkedin.com/in/sandeep-chilana-a271586",
    "bio": "Mr. Sandeep Chilana specializes in taxation, white collar, money laundering and commercial laws with focus on strategic planning, advisory and litigation services having a total experience of more than 14 years.\nPrior to starting Chilana independent chamber practice, Sandeep worked as Partner with Shardul Amarchand Mangaldas & Co. for more than 11 years.\nAmongst others, he has been well recognized in the industry as one of the thought leaders on taxation laws and has successfully advised various domestic and multinational client on various complex tax structuring transactions. He is also a part of various expert committees of business chambers on GST.\nSandeep has in-depth experience in providing end-to-end handholding support to clients in investigation by various authorities such as Central Bureau of Investigation (CBI), Enforcement Directorate (ED), Directorate General of Revenue Intelligence (DRI), Directorate General of GST Investigation (DGGI), Serious Fraud Investigation Office (SFIO) etc. in relation to allegations of tax evasion, white collar crime, money laundering, benami properties etc.\nSandeep also regularly represent various clients on complicated litigation issues before various judicial foras including NCLT, Tax Tribunals, High Courts and the Hon’ble Supreme Court of India.\nSandeep has extensively worked with clients from various sectors such as Oil & Gas, Automotive, Information Technology, Infrastructure, Telecommunication and Health Care, Not-for-profit Organization.\nSandeep is a prolific speaker and is regularly invited to speak on various tax and international trade issues. He is also extensively quoted in leading business and legal publications on various legal issues.",
    "practice_areas": [
      "Arbitration Law",
      "Intellectual Property",
      "White Collar Crimes",
      "Taxation",
      "Bankruptcy & Insolvency",
      "Commercial Litigation",
      "International Trade"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/sandeep-peters",
    "name": "Sandeep Peters",
    "location": "BDO India Koramangala Bangalore",
    "experience": "17 years of experience.",
    "languages": [
      "English\nHindi\nMalyalam"
    ],
    "phone": "9873259847",
    "email": "sandeeppeters@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/sandeep-peters&title=Sandeep%20Peters&summary=Sandeep%20Peters&source=Sandeep%20Peters",
    "bio": "17years of experience with law firms in India.",
    "practice_areas": [
      "Bankruptcy & Insolvency",
      "Start-up Advisory & Compliance",
      "Private Equity & Venture Capital",
      "Corporate Secretarial"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/sanket-s-kulkarni",
    "name": "Sanket S Kulkarni",
    "location": "N 4, H Sector, Plot No40, Near New High Court Building, CIDCO, Chatrapati Sambhajinagar (Earlier Aurangabad), 431005",
    "experience": "19 years of experience.",
    "languages": [
      "English\nHindi\nMarathi"
    ],
    "phone": "9890492452",
    "email": "info@advocatesanketkulkarni.com",
    "website": "https://advocatesanketkulkarni.com/",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/sanket-s-kulkarni&title=Sanket%20S%20Kulkarni&summary=Sanket%20S%20Kulkarni&source=Sanket%20S%20Kulkarni",
    "bio": "Practicinsg since 2006. Have experienec of arguing before various courts all kind of matters. Have several reported judgements.",
    "practice_areas": [
      "Family Law",
      "Matrimonial Disputes",
      "Bankruptcy & Insolvency",
      "Constitutional Law",
      "Civil Litigation",
      "Private Client Practice",
      "Cyber Law",
      "Artificial Intelligence",
      "Conveyance",
      "Tenders & Government Procurement",
      "Business Law",
      "Service Law",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Bombay High Court",
      "Debts Recovery Tribunal, Aurangabad"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/sayantani-dutta",
    "name": "Sayantani Dutta",
    "location": "Ashwinipally, Barasat, Kolkata-700124",
    "experience": "3 years of experience.",
    "languages": [
      "Bengali\nEnglish\nHindi"
    ],
    "phone": "917477368333",
    "email": "somlina123roy@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/advsayantani-dutta",
    "bio": "With over 3 years of experience, I am a contract drafting counsel and legal consultant providing full range of drafting services in a purely freelance and virtual manner. I am passionate about helping startups and enterpreneurs by helping them navigate the complex legal landscape and achieve their business goals.\nI am a specialist in contract drafting, corporate and commercial laws, fintech-related laws, and legal content creation. I hold a BA LLB (Hons.) degree from Calcutta University. As an external consultant and advisor, I provide support to various companies to help develop business development strategies, advise regarding regulatory compliance, and negotiating with clients. My vision is to offer innovative and diverse legal solutions that are accessible, affordable, and efficient.",
    "practice_areas": [
      "Intellectual Property",
      "Contracts",
      "Start-up Advisory & Compliance",
      "General Corporate",
      "Data Privacy & Protection",
      "Negotiation",
      "Cross Border Transactions"
    ],
    "forums_of_practice": [
      "Calcutta High Court",
      "Bankshall Court",
      "Alipore Court"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/sohan-patil",
    "name": "Sohan Patil",
    "location": "West Patel nagar 17/25",
    "experience": "1 years of experience.",
    "languages": [
      "English\nHindi\nKannada"
    ],
    "phone": "917411114594",
    "email": "sohanpatil4444@gmail.com",
    "website": null,
    "linkedin": "https://www.linkedin.com/in/sohan-patil-3696711aa?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_contact_details%3BDIsevnZ0QU6bV1YgAg0Zog%3D%3D",
    "bio": "Passionate Advocate enrolled under Delhi Bar Council, dedicated to delivering impactful legal solutions in the realm of civil and commercial litigation. With a proven track record of navigating complex legal challenges, I thrive on advocating for my clients' rights and interests.\n\n🔍 Expertise:\nCivil Litigation: Proficient in handling a wide range of civil cases, including contract disputes, property matters, tort claims, and more. Committed to securing just outcomes through meticulous research, strategic planning, and persuasive representation.\nCommercial Litigation: Experienced in representing businesses and individuals in commercial disputes, such as contract breaches, intellectual property conflicts, and corporate disagreements. Bringing a unique blend of legal acumen and business understanding to effectively resolve intricate issues.\n\n🌟 Approach:\nMy approach to law is characterized by a balance of empathy and rigor. I believe in comprehensively understanding my clients' needs and concerns, while applying a rigorous legal analysis to devise tailored strategies that align with their goals. Client satisfaction and justice are at the heart of my practice.\n\n🤝 Collaborative Engagement:\nCollaboration is key to my practice. I collaborate closely with clients to keep them informed at every step of the legal process, ensuring transparent communication and informed decision-making. Additionally, I collaborate with fellow legal professionals to stay updated on evolving legal trends and best practices.\n\n📚 Continuous Learning:\nThe legal landscape is ever-evolving, and I am committed to staying at the forefront of legal developments. By engaging in continuous learning, attending seminars, and participating in legal forums, I ensure that my clients benefit from the latest legal insights and strategies.",
    "practice_areas": [
      "Family Law",
      "Criminal Law",
      "Start-up Advisory & Compliance",
      "Civil Litigation",
      "Debt Recovery",
      "Dispute Resolution",
      "Due Diligence",
      "Succession & Estate Planning",
      "Service Law",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "Supreme Court of India"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/suman-kumar-jha",
    "name": "Suman Kumar Jha",
    "location": "912 Wave silver tower, Sector -18, Noida. 201301",
    "experience": "13 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919711261555",
    "email": "suman@corplegex.com",
    "website": "https://www.corplegex.com/",
    "linkedin": "https://www.linkedin.com/in/sumankumarcs?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_contact_details%3BWn73xaxlToCQ%2BaiI2p2l%2Fg%3D%3D",
    "bio": "Suman Kumar Jha is an accomplished advocate with a wealth of 13+ years of experience in M&A and Transaction Advisory. Holding a law degree from the University of Delhi and being a qualified Company Secretary, he excels in addressing intricate corporate restructuring challenges. His expertise extends to advising on diverse legal issues, including direct and indirect tax implications, Stamp Duty, and SEBI laws. Suman Kumar Jha's clientele includes esteemed government companies, public sector undertakings, listed and unlisted companies for whom he provides strategic counsel and effective representation before top tribunals and regulatory bodies.",
    "practice_areas": [
      "Arbitration Law",
      "Bankruptcy & Insolvency",
      "Mergers & Acquisitions",
      "Debt Recovery",
      "Private Client Practice",
      "Capital Markets",
      "Regulatory & Securities",
      "Dispute Resolution",
      "Restructuring",
      "Corporate Secretarial",
      "Legal Advisory & Consultancy",
      "Commercial Litigation"
    ],
    "forums_of_practice": [
      "High Court of Delhi",
      "Bombay High Court",
      "Calcutta High Court",
      "National Company Law Tribunal (NCLT)",
      "National Company Law Appellate Tribunal (NCLAT)"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/ujwala-shinde",
    "name": "Ujwala Shinde",
    "location": "",
    "experience": "21 years of experience.",
    "languages": [
      "English\nHindi\nMarathi"
    ],
    "phone": "919822632413",
    "email": "shinde.ujwala@yahoo.com",
    "website": "https://www.ujwalashindelawchambers.com/",
    "linkedin": "https://www.linkedin.com/in/ujwala-shinde-a729ab59/",
    "bio": "Adv. Dr. Ujwala practices as an Arbitrator and a Mediator.\nGraduation in Law from ILS Law College, Pune in 1985, Ujwala practiced independently at  Shivaji Nagar District Court handling all types of cases and working for builder clients. She started her academic career in 1999. Her PH.D. in Alternative Dispute Resolution system shows her keen interest in Arbitration and Mediation practice. She enjoyed her tenure as a Principal of Law College for around 20 years. Ujwala is empaneled at Bombay High Court as a Mediator and as an Arbitrator. Hon’ble Bombay High Court is pleased to refer cases to her for Mediation as well as for Arbitration. Ujwala is empaneled as an Arbitrator with Indian Institute of Arbitration and Mediation (IIAM). With commerce background she has handled settlement cases skillfully. Ujwala is neutral and believes in win-win situation of the parties.",
    "practice_areas": [
      "Arbitration Law",
      "Mediation & Conciliation",
      "Negotiation"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/vasagi-r",
    "name": "Vasagi R",
    "location": "No.10, 4 th Main,BGS Layout, Jambu Savari Dinne, JP Nagar 8 th Phase, Bengaluru - 560 076.",
    "experience": "5 years of experience.",
    "languages": [
      "English\nHindi\nKannada"
    ],
    "phone": "917022623785",
    "email": "vasagi98ravi@gmail.com",
    "website": "https://grayarclegal.com/",
    "linkedin": "https://www.linkedin.com/in/vasagir98/?originalSubdomain=in",
    "bio": "Ms.Vasagi is a trailblazing first-generation advocate, whose legal journey began amidst the intricacies of civil disputes, family matters, and the ever-persistent issue of cheque bounce cases. She later extended her practice take up cross- border family disputes involving complicated questions of private international law.\nShe utilizes her prior experiences and passion to help clients through every step of litigation to provide peace of mind while representing on their behalf in an effort to resolve every claim and dispute efficiently.\nMs. Vasagi carefully analyzes the facts of every case and uses her knowledge of the law to aggressively protect her clients’ rights and to provide the highest standard of legal representation for every client.\nMs.Vasagi represents her clients before various Lower Courts, Authorities, Tribunals and High Court of Karnataka.",
    "practice_areas": [
      "Family Law",
      "POSH Advisory",
      "Criminal Law",
      "Real Estate",
      "Property Law",
      "Civil Litigation",
      "Debt Recovery",
      "Succession & Estate Planning",
      "Commercial Litigation",
      "Private International Law"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/yakub-ali-advocate",
    "name": "Yakub Ali Advocate",
    "location": "12-10-103/4/9, Mailargadda, Seetaphalmandi, Secunderabad. 500017t",
    "experience": "10 years of experience.",
    "languages": [
      "English\nHindi\nTelegu"
    ],
    "phone": "9700724527",
    "email": "yakub9392@live.com",
    "website": "https://www.aryalawnetwork.net/telangana/hyderabad/top-10-best-famous-lawyers/famous-high-court-lawyers-in-hyderabad",
    "linkedin": "https://www.linkedin.com/shareArticle?mini=true&url=https://theindianlegaldirectory.com/list-lawyers/yakub-ali-advocate&title=Yakub%20Ali%20Advocate&summary=Yakub%20Ali%20Advocate&source=Yakub%20Ali%20Advocate",
    "bio": "When legal matters escalate beyond the trial court level, having an experienced and reputed High Court lawyer becomes essential. Hyderabad, being the seat of the Telangana High Court, is home to some of the finest legal minds. Whether it is a writ petition, criminal appeal, quashing of FIR, or civil revision, the right legal representation can make all the difference.\nAt Arya Law Network, led by Advocate Md Yakub Ali, we bring more than a decade of experience in handling complex High Court matters. Known for our strategic litigation, sharp drafting, and personalized legal attention, we are proud to be counted among the famous High Court lawyers in Hyderabad.\n👨‍⚖️ Why You Need a High Court Lawyer in Hyderabad\nHigh Court practice is highly specialized. It involves deep knowledge of not only substantive laws like civil, criminal, and constitutional law but also procedural laws such as the CPC, CrPC, and writ jurisdiction.\nHere’s why hiring a High Court advocate is essential:\n✅ Jurisdiction Expertise: The Telangana High Court has original and appellate jurisdiction — handling writs, appeals, and revisions.\n✅ Time-sensitive Matters: Injunctions, bail applications, and stay orders must be filed swiftly and strategically.\n✅ Advanced Drafting: Petitions, counter-affidavits, and rejoinders must meet strict formatting and legal standards.\n✅ Courtroom Experience: Arguing in the High Court requires deep familiarity with judges' practices, procedures, and legal precedent.\nAt Arya Law Network, we have successfully handled all of the above — earning the confidence of clients across Telangana and beyond.\n⚖️ Advocate Md Yakub Ali – Legal Experience That Matters\nWith over 10 years of legal practice, Advocate Md Yakub Ali is a regular practitioner at the Telangana High Court, appearing in both civil and criminal matters, including:\nWrit Petitions (W.P.): Against illegal government action, service matters, land acquisition, and education-related issues\nCivil Appeals & Revisions: Challenging district court judgments and interlocutory orders\nQuashing Petitions (Section 482 CrPC): For FIRs and criminal proceedings without merit\nBail Matters: Anticipatory and regular bail in serious criminal cases\nPublic Interest Litigation (PIL): Where justice affects a larger group or public interest\nHe is respected not only for legal strategy and oral arguments but also for ethical practice and deep client empathy.\n📄 Types of High Court Cases We Handle\nAs one of the best High Court law firms in Hyderabad, we regularly handle the following categories of matters:\n🔸 Civil Matters\nTitle disputes\nProperty injunctions\nCivil appeals & second appeals\nRent control and eviction matters\nConsumer protection appeals\n🔸 Criminal Matters\nQuashing of FIRs\nCriminal revisions and bail applications\nAppeals against conviction/acquittal\n🔸 Constitutional & Service Law\nWrits under Article 226 & 227\nGovernment service disputes\nEducational institution and exam-related issues\n🔸 Miscellaneous\nCompany Law matters (NCLT appeals)\nArbitration-related challenges\nPILs and Human Rights litigation\nWe serve individuals, NRIs, business entities, and professionals with the utmost confidentiality and diligence.\n🧾 Why Clients Trust Arya Law Network\nOur reputation as one of the famous High Court lawyers in Hyderabad is not self-proclaimed — it is built on trust, transparency, and results. Here's what sets us apart:\n✅ Direct Access to Senior Advocate: No middlemen. Every case is personally reviewed by Advocate Md Yakub Ali.\n✅ Clarity in Advice: We simplify complex High Court procedures for our clients.\n✅ Timely Filing: Our legal team ensures every petition is drafted, verified, and filed without delay.\n✅ High Success Rate: We focus on legal merit, honest assessments, and courtroom preparation.\n🌍 Serving Clients in Hyderabad, Telangana & Beyond\nWhether you're a resident of Hyderabad, an NRI managing property disputes, or a professional wrongly implicated in a case, we provide remote consultations and court representation for Telangana High Court matters.\nAreas we commonly serve:\nHigh Court at Nampally\nRanga Reddy, Medchal, and Sangareddy matters escalated to HC\nNRIs from the Gulf, UK, USA seeking legal aid in Telangana\nBeing recognized among the famous High Court lawyers in Hyderabad is not about popularity — it is about reliability, legal excellence, and integrity. At Arya Law Network, we are committed to justice and take pride in every case we represent. When you need experienced legal support at the highest level, we’re just a call away.",
    "practice_areas": [
      "Arbitration Law",
      "Aviation Law",
      "Consumer Law & Product Liability",
      "Family Law",
      "Motor Accidents",
      "Employment & Labour Laws",
      "Company Registration",
      "Intellectual Property",
      "POSH Advisory",
      "Matrimonial Disputes",
      "Divorce",
      "White Collar Crimes",
      "Criminal Law",
      "Taxation",
      "Contracts",
      "Insurance Law",
      "Bankruptcy & Insolvency",
      "Mediation & Conciliation",
      "Media & Entertainment",
      "Marine & Shipping Law",
      "Immigration & Customs Law",
      "Start-up Advisory & Compliance",
      "Environmental Law",
      "Mergers & Acquisitions",
      "Fashion Law",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Human Rights Law",
      "Animal Law",
      "Constitutional Law",
      "Sports & Gaming Law",
      "Civil Litigation",
      "Debt Recovery",
      "Environmental, Social & Governance",
      "Telecom Law",
      "Private Client Practice",
      "Cyber Law",
      "Data Privacy & Protection",
      "Capital Markets",
      "Regulatory & Securities",
      "Private Equity & Venture Capital",
      "Dispute Resolution",
      "Infrastructure & Projects",
      "Project Finance",
      "Restructuring",
      "Corporate Secretarial",
      "Artificial Intelligence",
      "Asset Management & Funds",
      "Banking & Finance",
      "Due Diligence",
      "Conveyance",
      "Funding Advisory",
      "NRI Legal Assistance",
      "Competition & Anti-trust",
      "Succession & Estate Planning",
      "Mining Law",
      "Tenders & Government Procurement",
      "Electricity & Energy",
      "Domestic & Foreign Investment",
      "Negotiation",
      "Business Law",
      "Service Law",
      "Legal Advisory & Consultancy",
      "Space Law",
      "Commercial Litigation",
      "Risk Assessment & Management",
      "Admiralty Law",
      "Private International Law",
      "International Trade",
      "Armed Forces Law",
      "Cross Border Transactions",
      "Art Law"
    ],
    "forums_of_practice": [
      "Supreme Court of India",
      "National Company Law Tribunal (NCLT)",
      "Telengana High Court",
      "City Civil Court, Hyderabad",
      "City Civil Court, Secunderabad",
      "Ranga Reddy District Court",
      "Kukatpally District Court",
      "Debts Recovery Tribunal, Hyderabad",
      "Medchal-Malkajgiri District Court",
      "State Consumer Disputes Redressal Commission, Telengana",
      "Customs Excise And Service Tax Appellate Tribunal",
      "National Company Law Appellate Tribunal (NCLAT)",
      "Debts Recovery Appellate Tribunal (DRAT)",
      "Real Estate Regulatory Authortity (RERA), Telengana",
      "Central Administrative Tribunal"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/yash-vardhan-rana",
    "name": "Yash Vardhan Rana",
    "location": "Suite 702, Tower 10, Parsvnath La Tropicana, near B.D. Estate, Civil Lines, Delhi-110054",
    "experience": "10 years of experience.",
    "languages": [
      "English\nHindi"
    ],
    "phone": "919910887642",
    "email": "info@yvrlawoffices.com",
    "website": "https://www.yvrlawoffices.com/",
    "linkedin": "https://www.linkedin.com/in/yashvardhanrana/",
    "bio": "Yash Vardhan Rana is an Intellectual Property Lawyer with a particular focus on IP prosecution and transactional practice encompassing a broad range of areas including but not limited to – from registrability analysis and risk management to providing legal opinion on trademark clearance and protection strategy for the availability of use, adoption and registrability of trademarks to be launched by individuals, small businesses, Fortune 500 companies as well as top FMCGs in India and large corporations, including assisting them with filing new trademark and copyright applications and maintaining their trademark portfolios worldwide since the year 2013.",
    "practice_areas": [
      "Intellectual Property",
      "Criminal Law",
      "Taxation",
      "Contracts",
      "Start-up Advisory & Compliance",
      "General Corporate",
      "Real Estate",
      "Property Law",
      "Data Privacy & Protection"
    ],
    "forums_of_practice": [],
    "image_url": "/lawyers/placeholder.jpg"
  },
  {
    "profile_url": "https://theindianlegaldirectory.com/lawyer/yukta-muniraj",
    "name": "Yukta Muniraj",
    "location": "No 51, 4th Cross, 1st Main, Health Layout Annapurneshwari Nagar, 2nd Stage, Naagarabhaavi, Bengaluru, Karnataka 560091",
    "experience": "2 years of experience.",
    "languages": [
      "English\nHindi\nKannada"
    ],
    "phone": "9686575634",
    "email": "yukta.m@ipowl.in",
    "website": "https://www.ipowl.in/",
    "linkedin": "https://www.linkedin.com/in/yukta-muniraj-3375021b4/",
    "bio": "I’m a practicing advocate and the founder of an independent law firm that specialises in Intellectual Property law. My work primarily focuses on trademarks, copyrights, and design registration ,  from filing and prosecution to enforcement and litigation.\nI assist clients with brand protection strategies, trademark clearance searches, filing word and device marks (including multi-class applications), and handling objections, oppositions, and portfolio management. I also advise on copyright and design-related matters, along with IP issues involving digital platforms and emerging technologies like AI.\nMy approach is straightforward and solution-oriented , I believe in offering clear legal guidance that aligns with business goals, whether it’s for a startup building its brand or a company seeking long-term IP protection.\nPractice Areas:\nTrademark Registration & Prosecution\nCopyright & Design Protection\nIP Strategy & Portfolio Management\nIP Litigation & Enforcement\nDigital & AI-related IP Advisory\nCommercial IP Agreements",
    "practice_areas": [
      "Intellectual Property",
      "Contracts",
      "Fashion Law",
      "Cyber Law",
      "Art Law"
    ],
    "forums_of_practice": [
      "High Court of Karnataka"
    ],
    "image_url": "/lawyers/placeholder.jpg"
  }
]